//syscode统一接口

(function(){
	if(window.syscode){
		return;
	}
	var syscode=window.syscode={};

	syscode.buxian='-1,不限';

	syscode.qingxuanze='-1,请选择';
	
	syscode.qingxuanze2='0,请选择';
	
	syscode.lv = ["1,LV1","2,LV2","3,LV3","4,LV4","5,LV5","6,LV6","7,LV7"];

	syscode.expectlovedate=["1,1个月内","2,3个月内","3,半年内","4,一年及一年以上"];

	syscode.viewtype=["3,相册模式","2,资料模式"];

	syscode.orderby=["hpf,原始顺序","createtime,最新注册","age,年龄顺序"];

	syscode.searchheight=["1,155cm以下","2,155cm-160cm","3,160cm-165cm","4,165cm-170cm","5,170cm-175cm","6,175cm-180cm","20,180cm以上"];

	syscode.searchweight=["1,40kg以下","2,40kg－45kg","3,45kg－50kg","4,50kg－55kg","5,55kg－60kg","6,60kg－65kg","7,65kg－70kg","8,70kg－80kg","9,80kg以上"];
	//年份
	syscode.years=["1996","1995","1994","1993","1992","1991","1990","1989","1988","1987","1986","1985","1984","1983","1982","1981","1980","1979","1978","1977","1976","1975","1974","1973",
				   "1972","1971","1970","1969","1968","1967","1966","1965","1964","1963","1962","1961","1960","1959","1958","1957","1956","1955","1954","1953",
				   "1952","1951","1950","1949","1948","1947","1946","1945","1944","1943","1942","1941","1940","1939","1938","1937","1936","1935","1934","1933",
				   "1932","1931","1930","1929","1928","1927","1926","1925","1924","1923","1922","1921"];
	//月份
	syscode.months=["1","2","3","4","5","6","7","8","9","10","11","12"];
	//日期
	syscode.days=["1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23","24","25","26","27","28","29","30","31"];
	//投诉原因
	syscode.warnreason=["1,虚假照片","2,虚假信息","3,发送骚扰邮件","4,线下言行不检","99,其它原因"];
	//婚姻 new Array("-1,请选择","0,保留","1,未婚","2,已婚","3,离异","4,丧偶","5,分居");
	syscode.marriage=["1,未婚","3,离异","4,丧偶"];
	//教育程度  new Array("-1,请选择","1,初中","2,高中","3,中专","4,大专","5,大学","6,硕士","7,博士");
	syscode.education=["3,高中及以下","2,中专","4,大专","5,大学本科","6,硕士","7,博士"];
	//会员类型
	syscode.membertype=["1,普通会员","2,珍爱通会员"];
	//明星年龄段
	syscode.starage=["18-24,18-24","25-29,25-29","30-34,30-34","35-39,35-39","40-44,40-44","45-49,45-49","50-54,50-54","55-59,55-59","60-64,60-64","65-69,65-69","70-74,70-74","75-79,75-79","80-84,80-84","85-89,85-89","90-94,90-94","95-99,95-99"];
	//性别
	syscode.sex=["0,男士","1,女士"];
	//在意Ta喝酒吗
	syscode.drinking=["0,都可以","1,在意"];
	//在意Ta吸烟吗
	syscode.smoking=["0,都可以","1,在意"];
	//是否喝酒
	syscode.isDrinking  =["1,不喝酒","2,稍微喝一点","4,只在社交场合喝","3,喝得很多"];
	syscode.taIsDrinking=["1,不喝酒","2,稍微喝一点","4,只在社交场合喝","3,喝得很多"];
	//是否吸烟
	syscode.isSmoking  =["1,不吸烟","2,稍微抽一点儿","5,只在社交场合抽","3,抽得很多"];
	syscode.taIsSmoking=["1,不吸烟","2,稍微抽一点儿","5,只在社交场合抽","3,抽得很多"];
	//月薪
	syscode.salary=["3,3000元以下","4,3001-5000元","5,5001-8000元","6,8001-12000元","7,12001-20000元","8,20001-50000元","9,50000元以上"];
	syscode.salary2=["103,3000元","104,5000元","105,8000元","106,12000元","107,20000元","108,50000元"];
	//血型
	syscode.bloodtype=["1,A型","2,B型","3,AB型","4,O型","5,不确定"];
	//民族
	syscode.stock=["1,汉族","2,藏族","3,朝鲜族","4,蒙古族","5,回族","6,满族","7,维吾尔族","8,壮族","9,彝族","10,苗族","11,侗族","12,瑶族","13,白族","14,布依族","15,傣族","16,京族","17,黎族","18,羌族","19,怒族","20,佤族","21,水族","22,畲族","23,土族","24,阿昌族","25,哈尼族","26,高山族","27,景颇族","28,珞巴族","29,锡伯族","30,德昂(崩龙)族","31,保安族","32,基诺族","33,门巴族","34,毛南族","35,赫哲族","36,裕固族","37,撒拉族","38,独龙族","39,普米族","40,仫佬族","41,仡佬族","42,东乡族","43,拉祜族","44,土家族","45,纳西族","46,傈僳族","47,布朗族","48,哈萨克族","49,达斡尔族","50,鄂伦春族","51,鄂温克族","52,俄罗斯族","53,塔塔尔族","54,塔吉克族","55,柯尔克孜族","56,乌兹别克族","57,国外"];
	//信仰
	syscode.belief  =["2,不信教","5,佛教","12,道教","8,伊斯兰教","11,基督教","6,天主教","3,儒家门徒","1,不可知论者","13,其他宗教"];
	syscode.taBelief=["2,不信教","5,佛教","12,道教","8,伊斯兰教","11,基督教","6,天主教","3,儒家门徒","1,不可知论者","13,其他宗教"];
	//生肖
	syscode.animals=["0,不限","1,鼠","2,牛","3,虎","4,兔","5,龙","6,蛇","7,马","8,羊","9,猴","10,鸡","11,狗","12,猪"];
	//星座
	syscode.constellation=["1,白羊座(03.21-04.20)","2,金牛座(04.21-05.20)","3,双子座(05.21-06.21)","4,巨蟹座(06.22-07.22)","5,狮子座(07.23-08.22)","6,处女座(08.23-09.22)","7,天秤座(09.23-10.22)","8,天蝎座(10.23-11.21)","9,射手座(11.22-12.21)","10,魔羯座(12.22-01.19)","11,水瓶座(01.20-02.19)","12,双鱼座(02.20-03.20)"];

	syscode.occupation=['100,销售','200,客户服务','300,计算机/互联网','400,通信/电子','500,生产/制造','600,物流/仓储','700,商贸/采购','800,人事/行政','900,高级管理','1000,广告/市场','1100,传媒/艺术','1200,生物/制药','1300,医疗/护理','1400,金融/银行/保险','1500,建筑/房地产','1600,咨询/顾问','1700,法律','1800,财会/审计','1900,教育/科研','2000,服务业','2100,交通运输','2200,政府机构','2300,军人/警察','2400,农林牧渔','2500,自由职业','2600,在校学生','2700,待业','2800,其他行业'];
	syscode.occupationbt=['100,销售','200,客户服务','300,计算机','400,通信/电子','500,生产/制造','600,物流/仓储','700,商贸/采购','800,人事/行政','900,高级管理','1000,广告/市场','1100,传媒/艺术','1200,生物/制药','1300,医疗/护理','1400,金融/保险','1500,建筑/地产','1600,咨询/顾问','1700,法律','1800,财会/审计','1900,教育/科研','2000,服务业','2100,交通运输','2200,政府机构','2300,军人/警察','2400,农林牧渔','2500,自由职业','2600,在校学生','2700,待业','2800,其他行业'];	
	syscode.occupation2=['101,销售总监','102,销售经理','103,销售主管','104,销售专员','105,渠道/分销管理','106,渠道/分销专员','107,经销商','108,客户经理','109,客户代表','110,其他','201,客服经理','202,客服主管','203,客服专员','204,客服协调','205,客服技术支持','206,其他','301,IT技术总监','302,IT技术经理','303,IT工程师','304,系统管理员','305,测试专员','306,运营管理','307,网页设计','308,网站编辑','309,网站产品经理','310,其他','401,通信技术','402,电子技术','403,其他','501,工厂经理','502,工程师','503,项目主管','504,营运经理','505,营运主管','506,车间主任','507,物料管理','508,生产领班','509,操作工人','510,安全管理','511,其他','601,物流经理','602,物流主管','603,物流专员','604,仓库经理','605,仓库管理员','606,货运代理','607,集装箱业务','608,海关事物管理','609,报单员','610,快递员','611,其他','701,商务经理','702,商务专员','703,采购经理','704,采购专员','705,外贸经理','706,外贸专员','707,业务跟单','708,报关员','709,其他','801,人事总监','802,人事经理','803,人事主管','804,人事专员','805,招聘经理','806,招聘专员','807,培训经理','808,培训专员','809,秘书','810,文员','811,后勤','812,其他','901,总经理','902,副总经理','903,合伙人','904,总监','905,经理','906,总裁助理','907,其他','1001,广告客户经理','1002,广告客户专员','1003,广告设计经理','1004,广告设计专员','1005,广告策划','1006,市场营销经理','1007,市场营销专员','1008,市场策划','1009,市场调研与分析','1010,市场拓展','1011,公关经理','1012,公关专员','1013,媒介经理','1014,媒介专员','1015,品牌经理','1016,品牌专员','1017,其他','1101,主编','1102,编辑','1103,作家','1104,撰稿人','1105,文案策划','1106,出版发行','1107,导演','1108,记者','1109,主持人','1110,演员','1111,模特','1112,经纪人','1113,摄影师','1114,影视后期制作','1115,设计师','1116,画家','1117,音乐家','1118,舞蹈','1119,其他','1201,生物工程','1202,药品生产','1203,临床研究','1204,医疗器械','1205,医药代表','1206,化工工程师','1207,其他','1301,医疗管理','1302,医生','1303,心理医生','1304,药剂师','1305,护士','1306,兽医','1307,其他','1401,投资','1402,保险','1403,金融','1404,银行','1405,证券','1406,其他','1501,建筑师','1502,工程师','1503,规划师','1504,景观设计','1505,房地产策划','1506,房地产交易','1507,物业管理','1508,其他','1601,专业顾问','1602,咨询经理','1603,咨询师','1604,培训师','1605,其他','1701,律师','1702,律师助理','1703,法务经理','1704,法务专员','1705,知识产权专员','1706,其他','1801,财务总监','1802,财务经理','1803,财务主管','1804,会计','1805,注册会计师','1806,审计师','1807,税务经理','1808,税务专员','1809,成本经理','1810,其他','1901,教授','1902,讲师/助教','1903,中学教师','1904,小学教师','1905,幼师','1906,教务管理人员','1907,职业技术教师','1908,培训师','1909,科研管理人员','1910,科研人员','1911,其他','2001,餐饮管理','2002,厨师','2003,餐厅服务员','2004,酒店管理','2005,大堂经理','2006,酒店服务员','2007,导游','2008,美容师','2009,健身教练','2010,商场经理','2011,零售店店长','2012,店员','2013,保安经理','2014,保安人员','2015,家政服务','2016,其他','2101,飞行员','2102,空乘人员','2103,地勤人员','2104,列车司机','2105,乘务员','2106,船长','2107,船员','2108,司机','2109,其他','2201,公务员','2202,其他'];

	//公司类别
	syscode.corptype =["1,政府机关","2,事业单位","4,外资企业","10,合资企业","6,国营企业","7,私营企业","8,自有公司","9,其他"];
	//住房条件
	syscode.house  =["1,和家人同住","2,已购房","3,租房","4,打算婚后购房","6,单位宿舍"];
	syscode.taHouse=["1,和家人同住","2,已购房","3,租房","4,打算婚后购房","6,单位宿舍"];
	
	//购房方式
	syscode.houseBuyWay  =["1,全款","2,贷款"];

	//购房每月还款金额
	syscode.buyHouseRepay  =["1,2000以下","2,2000-4000","3,4000-6000","4,6000-8000","5,8000以上"];

	//购车每月还款金额
	syscode.buyCarRepay  =["1,2000以下","2,2000-4000","3,4000-6000","4,6000-8000","5,8000以上"];

	//是否购车
	syscode.vehicle  =["1,已买车","2,未买车"];
	syscode.taVehicle=["1,已买车","2,未买车"];

	//购车方式
	syscode.vehicleBuyWay  =["1,全款","2,贷款"];

	//是否有孩子
	syscode.children   =["1,没有","3,有，我们住在一起","4,有，我们偶尔一起住","5,有，但不在身边"];
	syscode.taChildren =["1,没有","3,有孩子且住在一起","4,有孩子且偶尔会一起住","5,有孩子但不在身边"];
	//是否想要孩子
	syscode.wantChildren  =["2,想要孩子","3,不想要孩子","1,视情况而定"];
	syscode.taWantChildren=["2,希望对方要孩子","3,希望对方不要孩子","1,视情况而定"];
	//兄弟姐妹
	syscode.family =["1,独生子女","2,2","3,3","4,4","5,5","6,6","7,7","8,8"];
	//年龄
	syscode.age =["18,18","19,19","20,20","21,21","22,22","23,23","24,24","25,25","26,26","27,27","28,28","29,29","30,30","31,31","32,32","33,33","34,34","35,35","36,36","37,37","38,38","39,39","40,40","41,41","42,42","43,43","44,44","45,45","46,46","47,47","48,48","49,49","50,50","51,51","52,52","53,53","54,54","55,55","56,56","57,57","58,58","59,59","60,60","61,61","62,62","63,63","64,64","65,65","66,66","67,67","68,68","69,69","70,70","71,71","72,72","73,73","74,74","75,75","76,76","77,77","78,78","79,79","80,80","81,81","82,82","83,83","84,84","85,85","86,86","87,87","88,88","89,89","90,90","91,91","92,92","93,93","94,94","95,95","96,96","97,97","98,98","99,99"];
	//身高
	syscode.height =['129,130cm以下','130,130cm','131,131cm','132,132cm','133,133cm','134,134cm','135,135cm','136,136cm','137,137cm','138,138cm','139,139cm','140,140cm','141,141cm','142,142cm','143,143cm','144,144cm','145,145cm','146,146cm','147,147cm','148,148cm','149,149cm','150,150cm','151,151cm','152,152cm','153,153cm','154,154cm','155,155cm','156,156cm','157,157cm','158,158cm','159,159cm','160,160cm','161,161cm','162,162cm','163,163cm','164,164cm','165,165cm','166,166cm','167,167cm','168,168cm','169,169cm','170,170cm','171,171cm','172,172cm','173,173cm','174,174cm','175,175cm','176,176cm','177,177cm','178,178cm','179,179cm','180,180cm','181,181cm','182,182cm','183,183cm','184,184cm','185,185cm','186,186cm','187,187cm','188,188cm','189,189cm','190,190cm','191,191cm','192,192cm','193,193cm','194,194cm','195,195cm','196,196cm','197,197cm','198,198cm','199,199cm','200,200cm','201,201cm','202,202cm','203,203cm','204,204cm','205,205cm','206,206cm','207,207cm','208,208cm','209,209cm','210,210cm','211,210cm以上'];
	//体重
	syscode.weight=['29,30以下','30,30','31,31','32,32','33,33','34,34','35,35','36,36','37,37','38,38','39,39','40,40','41,41','42,42','43,43','44,44','45,45','46,46','47,47','48,48','49,49','50,50','51,51','52,52','53,53','54,54','55,55','56,56','57,57','58,58','59,59','60,60','61,61','62,62','63,63','64,64','65,65','66,66','67,67','68,68','69,69','70,70','71,71','72,72','73,73','74,74','75,75','76,76','77,77','78,78','79,79','80,80','81,81','82,82','83,83','84,84','85,85','86,86','87,87','88,88','89,89','90,90','91,91','92,92','93,93','94,94','95,95','96,96','97,97','98,98','99,99','100,100','101,101','102,102','103,103','104,104','105,105','106,106','107,107','108,108','109,109','110,110','111,111','112,112','113,113','114,114','115,115','116,116','117,117','118,118','119,119','120,120','121,121','122,122','123,123','124,124','125,125','126,126','127,127','128,128','129,129','130,130','131,130以上'];
	//男体形
	syscode.body0  =["1,一般","2,瘦长","3,运动员型","4,比较胖","5,体格魁梧","10,壮实","0,保密"];
//	syscode.body0  =["1,一般","12,偏瘦","11,修长","3,健壮","4,偏胖","5,魁梧"];
	syscode.taBody0=["0,保留","1,一般","2,瘦长","3,运动员型","4,比较胖","5,体格魁梧","10,矮壮结实"];
	//女体形
	syscode.body1  =["1,一般","2,瘦长","6,苗条","7,高大美丽","8,丰满","9,富线条美","0,保密"];
//	syscode.body1  =["1,一般","6,苗条","7,高挑","8,丰满","13,匀称","9,富线条美"];
	syscode.taBody1=["0,保留","1,一般","2,瘦长","6,苗条","7,高大美丽","8,丰满","9,富线条美"];	

	//喜爱的活动
	syscode.fondactions=["1,电脑/网络","2,电子游戏","4,与朋友喝酒","5,品茗","6,看电影/电视","7,听音乐","8,乐器演奏","9,烹调","10,摄影","11,下棋/打牌","12,观光旅游","13,逛街购物","14,阅读","15,写作","16,舞会/卡拉OK","18,各种收集活动","19,理财/投资","22,文艺表演","23,聊天","24,家务/手工艺","25,书法/绘画","27,其他"];
	//喜爱的体育运动
	syscode.fondsports=["1,足球","2,排球","3,篮球","4,骑单车/摩托车","5,乒乓球","6,保龄球","7,健身/跑步","8,钓鱼","9,游泳/冲浪/潜水","10,网球","11,羽毛球","12,高尔夫","13,滑冰/滑雪","14,其他"];
	//喜爱的音乐
	syscode.fondmusics=["1,中文流行音乐","2,轻音乐","3,民族音乐","4,老歌","5,舞曲","6,歌剧","7,西部乡村","8,英文流行音乐","9,交响乐","10,地方戏曲","11,摇滚","12,另类","13,灵歌","14,爵士/蓝调","15,其他"];
	//喜爱的影视节目
	syscode.fondprograms=["1,故事片","2,文艺爱情","3,科幻","4,动作武侠","5,侦探推理","6,实验电影","7,老电影","8,限制级电影","9,儿童/卡通片","10,纪录片","11,西部电影","12,恐怖","13,得奖电影","14,艺术电影","15,音乐歌舞","16,肥皂剧","17,喜剧","18,其他","19,什么都看"];
	//喜爱的食物
	syscode.fondfoods=["1,川菜","2,江浙菜","3,湘菜","4,火锅","5,烧烤","6,家常菜","7,路边摊","8,健康食品","9,零食","10,粤菜","11,北方菜","12,面食","13,素食","14,甜食","15,自助餐","16,减肥餐","17,能填饱肚子就好","18,其他"];
	//喜爱的地方
	syscode.fondplaces=["1,都市","2,村庄","3,小镇","4,山区","5,办公室/学校","6,游乐场","7,购物中心","8,我家/我的房间","9,海滨","10,岛屿","11,沙漠","12,雪野","13,图书馆/书店","14,展览馆","15,宗教圣地","16,古迹","17,森林","18,公园","19,咖啡厅/酒吧","20,动物园","21,夜市赶集","22,各种俱乐部","23,其他"];
	//语言能力
	syscode.tonguegifts=["1,汉语普通话","2,粤语","3,汉语其他方言","4,少数民族语言","5,英语","6,其他国语言"];
	//基本生活外的最大消费
	syscode.consumption=['1,美食','2,服饰','3,化妆','4,健身','5,娱乐','6,旅行','7,社交','8,文化','9,自我提升','10,其他'];
	//存款
	syscode.deposit=['1,3万以下','2,3-10万','3,10-50万','4,50万以上','5,保密'];
	//厨艺
	syscode.cuisine=['1,色香味俱全','2,能做几样可口的小菜','3,有待提高'];
	//家务
	syscode.housework=['1,愿承担大部分家务','2,希望对方承担大部分家务','3,看各自忙闲，协商分担家务'];
	//是否愿与对方父母同住
	syscode.liveWithParentsInLaw=['1,愿意','2,不愿意','3,视具体情况而定'];
	//婚后是否与自己父母同住
	syscode.liveWithParents=['1,与自己父母同住','2,不与自己父母同住','3,尊重伴侣意见','4,视具体情况而定'];
	//父母状况
	syscode.parents=['1,父母均健在','2,只有母亲健在','3,只有父亲健在','4,父母均已离世'];

	//父母经济状况
	syscode.parentIncomeState=['1,已退休，无经济压力','2,无经济来源需要赡养'];

	//兄弟姐妹数
	syscode.siblingsCount=['1,独生子女','2,2','3,3','4,4','5,5','6,6','7,7','8,8','9,更多'];

	//兄弟姐妹状况
	syscode.siblingsIncomeState=['1,需要经济支持','2,无经济压力'];

	//喜欢的约会场所/活动
	syscode.fonddate=['1,餐厅','2,茶楼','3,咖啡厅','4,酒吧','5,看电影','6,看演出','7,看展览','8,逛街','9,公园散步','10,郊游','11,户外运动','12,其它'];
	//何时结婚
	syscode.marryDate=['1,认同闪婚','2,一年内','3,两年内','4,三年内','5,时机成熟就结婚'];
	//宠物偏好
	syscode.keepPets=['1,没有，不愿意养','2,没有，愿意养','3,有'];
	//宠物
	syscode.pets=['1,狗','2,猫','3,鱼','4,兔','5,鸟','6,乌龟','7,蜥蜴','8,鼠','9,蛇','10,另类宠物'];

	//工作繁忙度
	syscode.workBusyLevel=['1,有双休','2,工作忙碌','3,工作清闲','4,自由工作时间','5,经常出差'];

	//婚恋史
	syscode.marriageHistory=['1,未谈过恋爱','2,谈过3次以内恋爱','3,恋爱次数很多'];

	//分手原因
	syscode.breakUpReason=['1,性格不合','2,对方没有上进心','3,其它'];

	//最长时间的一次恋爱
	syscode.longestLoveTime=['1,1年内','2,2年','3,3年','4,3年以上'];

	//单身原因
	syscode.singleReason=['1,生活圈子小 周围没找到合适的','2,上一段感情受伤','3,其它'];

	//征婚原因
	syscode.marriageSeekingReason=['1,年龄到了，岁月不等人','2,家人的期望，父母操心','3,生育的问题要及早考虑','4,身边的朋友差不多都结婚了','5,其他'];

	//结婚要不要彩礼
	syscode.isNeedBetrothalGifts=['1,根据习俗象征性的要点','2,必须要彩礼','3,不需要','4,协商'];

	//是否有处女（处男）情结
	syscode.isVirginComplexForMale=['1,对方必须是处女（处男）','2,不在意'];

	//是否有处女情结
	syscode.isVirginComplexForMale=['1,对方必须是处女','2,不在意'];

	//是否有处男情结
	syscode.isVirginComplexForFemale=['1,对方必须是处男','2,不在意'];

	//是否有生肖忌讳
	syscode.isChineseZodiacTaboo=['1,不想找属xx的','2,没有'];
 

	//生成下拉框
	/*
	* classStyle 样式
	* id select的id名称
	* name select的name名称
	* realValue 当前选项，用于数据回填
	* arrayObj 对应的数组
	* title 下拉框标题
	* event 选择框改变事件
	* isDisabled 是否禁用
	*/
	syscode.selectHtml=function(classStyle,id,name,realValue,defaultValue,options,title,event,isDisabled){
		if(event){
			if(isDisabled){
				var html='<select class="'+classStyle+'" id="'+id+'" name="'+name+'" onchange="'+event+'(this.value);return false;" disabled="disabled">';
			}else{
				var html='<select class="'+classStyle+'" id="'+id+'" name="'+name+'" onchange="'+event+'(this.value);return false;">';
			}
		}else{
			if(isDisabled){
				var html='<select class="'+classStyle+'" id="'+id+'" name="'+name+'" disabled="disabled">';
			}else{
				var html='<select class="'+classStyle+'" id="'+id+'" name="'+name+'">';
			}
			
		}
		if(title){
			var selected = '';
			var option = title.split(",");
			if(realValue!=null&&realValue!=''&&realValue==option[0]){
				selected = ' selected="selected"';
			}else if(defaultValue!=null&&defaultValue!=''&&defaultValue==option[0]){
					selected = ' selected="selected"';
			}
			html = html + '<option value="'+option[0]+'"'+selected+'>'+option[1]+'</option>';
		}
		for(var i=0;i<options.length;i++){
			var selected = '';
			var option = options[i].split(",");
			if(realValue!=null&&realValue!=''){
				if(realValue==option[0]){
					selected = ' selected="selected"';
				}
			}else if(defaultValue!=null&&defaultValue!=''&&defaultValue==option[0]){
					selected = ' selected="selected"';
			}
			html = html + '<option value="'+option[0]+'"'+selected+'>'+option[1]+'</option>';
		}
		html = html + '</select>';
		return html;
	};

	syscode.select=function(classStyle,id,name,realValue,defaultValue,options,title,event,isDisabled){
		document.write(syscode.selectHtml(classStyle,id,name,realValue,defaultValue,options,title,event,isDisabled));
	};

	/*添加下拉列表选项
	* text 显示的文本内容
	* value 选项值
	* obj 列表框
	*/
	syscode.addOption=function(text,value,select){
		var option = document.createElement("option");
		option.appendChild(document.createTextNode(text));
		option.setAttribute("value",value);
		select.appendChild(option);
	}

	//生成年份下拉框
	syscode.yearsSelect=function(classStyle,id,name,realValue){
		var html = '<select  class="'+classStyle+'" id="'+id+'" name="'+name+'">';
		html = html + '<option value="-1">请选择</option>';
		for(var i=0;i<syscode.years.length;i++){
			var selected = '';
			if(realValue!=null&&realValue!=''&&realValue==syscode.years[i]){
				selected = 'selected="selected"';
			}
			html = html + '<option value="'+syscode.years[i]+'" '+selected+'>'+syscode.years[i]+'</option>';
		}
		html = html + '</select>';
		document.write(html);
	}

	//生成月份下拉框
	syscode.monthsSelect=function(classStyle,id,name,realValue){
		var html = '<select  class="'+classStyle+'" id="'+id+'" name="'+name+'">';
		html = html + '<option value="-1">请选择</option>';
		for(var i=0;i<syscode.months.length;i++){
			var selected = '';
			if(realValue!=null&&realValue!=''&&realValue==syscode.months[i]){
				selected = 'selected="selected"';
			}
			html = html + '<option value="'+syscode.months[i]+'" '+selected+'>'+syscode.months[i]+'</option>';
		}
		html = html + '</select>';
		document.write(html);
	}
	//生成日期day下拉框
	syscode.daysSelect=function(classStyle,id,name,realValue){
		var html = '<select  class="'+classStyle+'" id="'+id+'" name="'+name+'">';
		html = html + '<option value="-1">请选择</option>';
		for(var i=0;i<syscode.days.length;i++){
			var selected = '';
			if(realValue!=null&&realValue!=''&&realValue==syscode.days[i]){
				selected = 'selected="selected"';
			}
			html = html + '<option value="'+syscode.days[i]+'" '+selected+'>'+syscode.days[i]+'</option>';
		}
		html = html + '</select>';
		document.write(html);
	}

	syscode.uncheckBuxian=function(thiz,buxian) {
		if(thiz.checked){
			buxian.checked=false;
		}
	}

	syscode.uncheckBuxian2=function(thiz,buxian) {
		if(thiz.checked){
			buxian.checked=false;
		}
		var oo=$(thiz);
		var id=oo.attr('id');
		var temp = new Array();
		temp = id.split("_");		
		var len = $("input[name="+temp[0]+"]:checked").size();
		if(len==0){
			$('#personal_'+temp[0]).removeClass('darrow current').addClass('darrow');
			document.getElementById(temp[0]+"_-1").checked="checked";
		}
	}

	syscode.checkBuxian=function(buxian,values) {
		if(buxian.checked){
			for(var j = 0; j<values.length;j++) {
				if(values.eq(j).attr('id')!=buxian.id){
					values.eq(j).removeAttr('checked');
				}
			}
		}
	}

	syscode.checkboxHtml=function(id,name,realValue,arrayObj,wrapperTagName,title){
		wrapperTagName=wrapperTagName||'li';
		var html = '';
		for(var i=0;i<arrayObj.length;i++){
			var selected = '';
			var valueArray = arrayObj[i].split(",");
			if(realValue!=null&&realValue!=''&&realValue.indexOf(","+valueArray[0]+",")>-1){
				selected = 'checked="checked"';
			}
			var onclick='';
			if(title){
				var titleArray=title.split(",");
				onclick="syscode.uncheckBuxian(this,document.getElementById('"+id+"_"+titleArray[0]+"'))";
			}
			html = html + '<'+wrapperTagName+'><input id="'+id+'_'+valueArray[0]+'" name="'+name+'" type="checkbox" value="'+valueArray[0]+'" onclick="'+onclick+'" '+selected+'/><label for="'+id+'_'+valueArray[0]+'">'+valueArray[1]+'</label></'+wrapperTagName+'>';
		}
		if(title){
			var valueArray=title.split(",");
			html+='<'+wrapperTagName+'><input id="'+id+'_'+valueArray[0]+'" name="'+name+'" type="checkbox" value="'+valueArray[0]+'" onclick="syscode.checkBuxian(this,$(\'input[name='+name+']\'));" /><label for="'+id+'_'+valueArray[0]+'">'+valueArray[1]+'</label></'+wrapperTagName+'>';
		}
		return html;
	}


	syscode.checkBuxian2=function(buxian,values,o) {
		if(buxian.checked){
			for(var j = 0; j<values.length;j++) {
				if(values.eq(j).attr('id')!=buxian.id){
					values.eq(j).removeAttr('checked');
				}
			}
			$('#'+o+"_title").remove();
			$('#personal_'+o).removeClass('current darrow').addClass('darrow');
		}
	}

	syscode.checkboxHtml2=function(id,name,realValue,arrayObj,wrapperTagName,title,itemname){
		wrapperTagName=wrapperTagName||'li';
		var html = '';
		var flag = false;
		for(var i=0;i<arrayObj.length;i++){
			var selected = '';
			var valueArray = arrayObj[i].split(",");
				if((realValue!=null&&realValue!=''&&realValue.indexOf(","+valueArray[0]+",")>-1)){
					selected = 'checked="checked"';
				}
			var onclick='';
			if(title){
				var titleArray=title.split(",");
				onclick="syscode.uncheckBuxian2(this,document.getElementById('"+id+"_"+titleArray[0]+"'))";
			}
			html = html + '<'+wrapperTagName+'><input id="'+id+'_'+valueArray[0]+'" name="'+name+'" type="checkbox" value="'+valueArray[0]+'" onclick="'+onclick+';addCondition(\''+itemname+'\',\''+valueArray[0]+'\',\''+valueArray[1]+'\');" '+selected+'/><label for="'+id+'_'+valueArray[0]+'">'+valueArray[1]+'</label></'+wrapperTagName+'>';
		}
		if(title){
			var valueArray=title.split(",");
			html+='<'+wrapperTagName+'><input id="'+id+'_'+valueArray[0]+'" name="'+name+'" type="checkbox" value="'+valueArray[0]+'" onclick="syscode.checkBuxian2(this,$(\'input[name='+name+']\'),\''+itemname+'\');" '+selected+' /><label for="'+id+'_'+valueArray[0]+'">'+valueArray[1]+'</label></'+wrapperTagName+'>';
		}
		return html;
	}	

	//生成checkbox
	/*
	* id select的id名称
	* name select的name名称
	* realValue 当前选项
	* arrayObj 对应的数组
	*/
	syscode.checkbox=function(id,name,realValue,arrayObj,wrapperTagName,title){
		document.write(syscode.checkboxHtml(id,name,realValue,arrayObj,wrapperTagName,title));
	}
	
	syscode.checkbox2=function(id,name,realValue,arrayObj,wrapperTagName,title,itemname){
		document.write(syscode.checkboxHtml2(id,name,realValue,arrayObj,wrapperTagName,title,itemname));
	}	

	syscode.occupationSelect=function(classStyle, id, name, occupationId, realValue, defaultValue, title) {
		var html = '<select class="'+classStyle+'" id="'+id+'" name="'+name+'" onchange=\'syscode.changeOccupation2Select(this.value,"'+occupationId+'","'+title+'");\'>';
		if(title){
			var selected = '';
			var option = title.split(",");
			if(realValue&&realValue==option[0]){
				selected = ' selected="selected"';
			}
			html = html + '<option value="'+option[0]+'"'+selected+'>'+option[1]+'</option>';
		}
		for (var i = 0; i < syscode.occupation.length; i++) {
			var selected = "";
			var option = syscode.occupation[i].split(",");
			if(realValue && realValue != '-1') {
				if (realValue-realValue%100 == option[0]) {
						selected = ' selected="selected"';
				}
			} else if (defaultValue && defaultValue != "-1") {
				if (defaultValue-defaultValue%100 == option[0]) {
					selected = ' selected="selected"';
				}
			}
			html = html + '<option value="' + option[0] + '"'+selected+'>' + option[1] + '</option>';
		}
		html = html + "</select>";
		document.write(html);
	};

	syscode.changeOccupation2Select=function(value,occupation2Id,title){
		if(!occupation2Id){
			return;
		}
		var occupation2 = document.getElementById(occupation2Id);
		if(!occupation2){
			return;
		}
		if(value==-1){
			if(occupation2.options[0].value==-1||occupation2.options[0].value%100==0){
				occupation2.options.length=1;
				occupation2.options[0].value='-1';
			}else{
				occupation2.options.length=1;
				occupation2.options[0].value='-1';
				occupation2.options[0].value='';
			}
			return;
		}
		if(occupation2.options[0].value==-1||occupation2.options[0].value%100==0){
			occupation2.options.length=1;
			occupation2.options[0].value=value-value%100;
		}else{
			occupation2.options.length=0;
		}
		for (var i = 0; i < syscode.occupation2.length; i++) {
			var option = syscode.occupation2[i].split(",");
			if (option[0]-option[0]%100 == value) {
				syscode.addOption(option[1],option[0],occupation2);
			}
		}
	}

	syscode.occupation2Select=function(classStyle,id,name,realValue,defaultValue,title){
		var html = '<select class="'+classStyle+'" id="'+id+'" name="'+name+'">';
		if(title){
			var selected = '';
			var option = title.split(",");
			if(realValue&&realValue==option[0]){
				selected = ' selected="selected"';
			}else if(realValue){
				option[0]=realValue-realValue%100;
			}
			html = html + '<option value="'+option[0]+'"'+selected+'>'+option[1]+'</option>';
		}
		if(!realValue||realValue == '-1'){
			html = html + '</select>';
			document.write(html);
			return;
		}
		for(var i=0;i<syscode.occupation2.length;i++){
			var selected = '';
			var option = syscode.occupation2[i].split(",");
			if(realValue&&realValue!='-1'){
				if(realValue==option[0]){
					selected = ' selected="selected"';
				}
				if(option[0]-option[0]%100==realValue-realValue%100){
					html += '<option value="'+option[0]+'"'+selected+'>'+option[1]+'</option>';
				}
			}else if(defaultValue&&defaultValue!='-1'){
				if(realValue==option[0]){
					selected = ' selected="selected"';
				}
				if(option[0]-option[0]%100==realValue-realValue%100){
					html += '<option value="'+option[0]+'"'+selected+'>'+option[1]+'</option>';
				}
			}
		}
		html = html + '</select>';
		document.write(html);
	};

    //----------------
    syscode.district={
        "c10102000":{n:"北京",d:1,"c10102001":{n:"东城区"},"c10102002":{n:"西城区"},"c10102005":{n:"朝阳区"},"c10102006":{n:"丰台区"},"c10102007":{n:"石景山区"},"c10102008":{n:"海淀区"},"c10102009":{n:"门头沟区"},"c10102010":{n:"房山区"},"c10102011":{n:"通州区"},"c10102012":{n:"顺义区"},"c10102013":{n:"昌平区"},"c10102014":{n:"大兴区"},"c10102015":{n:"怀柔区"},"c10102016":{n:"平谷区"},"c10102017":{n:"密云"},"c10102018":{n:"延庆"}},"c10104000":{n:"天津",d:1,"c10104008":{n:"和平区"},"c10104009":{n:"河东区"},"c10104010":{n:"河西区"},"c10104011":{n:"南开区"},"c10104012":{n:"河北区"},"c10104013":{n:"红桥区"},"c10104017":{n:"东丽区"},"c10104018":{n:"西青区"},"c10104020":{n:"津南区"},"c10104019":{n:"北辰区"},"c10104002":{n:"武清区"},"c10104005":{n:"宝坻区"},"c10104014":{n:"滨海新区"},"c10104003":{n:"宁河"},"c10104006":{n:"静海"},"c10104007":{n:"蓟县"}},"c10103000":{n:"上海",d:1,"c10103008":{n:"黄浦区"},"c10103002":{n:"徐汇区"},"c10103003":{n:"长宁区"},"c10103010":{n:"静安区"},"c10103004":{n:"普陀区"},"c10103005":{n:"闸北区"},"c10103006":{n:"虹口区"},"c10103007":{n:"杨浦区"},"c10103012":{n:"闵行区"},"c10103011":{n:"宝山区"},"c10103013":{n:"嘉定区"},"c10103001":{n:"浦东新区"},"c10103014":{n:"金山区"},"c10103015":{n:"松江区"},"c10103016":{n:"青浦区"},"c10103018":{n:"奉贤区"},"c10103017":{n:"崇明"}},"c10105000":{n:"重庆",d:1,"c10105042":{n:"万州区"},"c10105028":{n:"涪陵区"},"c10105034":{n:"渝中区"},"c10105035":{n:"大渡口区"},"c10105026":{n:"江北区"},"c10105036":{n:"沙坪坝区"},"c10105037":{n:"九龙坡区"},"c10105038":{n:"南岸区"},"c10105024":{n:"北碚区"},"c10105033":{n:"綦江区"},"c10105023":{n:"大足区"},"c10105040":{n:"渝北区"},"c10105041":{n:"巴南区"},"c10105018":{n:"黔江区"},"c10105016":{n:"长寿区"},"c10105029":{n:"江津区"},"c10105013":{n:"合川区"},"c10105007":{n:"永川区"},"c10105015":{n:"南川区"},"c10105027":{n:"潼南"},"c10105010":{n:"铜梁"},"c10105008":{n:"荣昌"},"c10105025":{n:"璧山"},"c10105021":{n:"梁平"},"c10105032":{n:"城口"},"c10105030":{n:"丰都"},"c10105020":{n:"垫江"},"c10105003":{n:"武隆"},"c10105004":{n:"忠县"},"c10105006":{n:"开县"},"c10105019":{n:"云阳"},"c10105002":{n:"奉节"},"c10105005":{n:"巫山"},"c10105017":{n:"巫溪"},"c10105012":{n:"石柱"},"c10105043":{n:"秀山"},"c10105044":{n:"酉阳"},"c10105045":{n:"彭水"}},"c10101000":{n:"广东","c10101002":{n:"广州","c10101208":{n:"荔湾区"},"c10101209":{n:"越秀区"},"c10101210":{n:"海珠区"},"c10101211":{n:"天河区"},"c10101212":{n:"白云区"},"c10101213":{n:"黄埔区"},"c10101021":{n:"番禺区"},"c10101084":{n:"花都区"},"c10101214":{n:"南沙区"},"c10101215":{n:"萝岗区"},"c10101089":{n:"增城"},"c10101052":{n:"从化"}},"c10101201":{n:"深圳","c10101202":{n:"罗湖区"},"c10101203":{n:"福田区"},"c10101204":{n:"南山区"},"c10101206":{n:"宝安区"},"c10101207":{n:"龙岗区"},"c10101205":{n:"盐田区"}},"c10101015":{n:"韶关","c10101216":{n:"市辖区"},"c10101085":{n:"始兴"},"c10101053":{n:"仁化"},"c10101078":{n:"翁源"},"c10101055":{n:"乳源"},"c10101050":{n:"新丰"},"c10101033":{n:"乐昌"},"c10101090":{n:"南雄"}},"c10101005":{n:"珠海","c10101217":{n:"市辖区"}},"c10101013":{n:"汕头","c10101218":{n:"市辖区"},"c10101057":{n:"南澳"}},"c10101003":{n:"佛山","c10101219":{n:"市辖区"}},"c10101016":{n:"江门","c10101220":{n:"市辖区"},"c10101098":{n:"台山"},"c10101066":{n:"开平"},"c10101040":{n:"鹤山"},"c10101037":{n:"恩平"}},"c10101004":{n:"湛江","c10101221":{n:"市辖区"},"c10101060":{n:"遂溪"},"c10101036":{n:"徐闻"},"c10101029":{n:"廉江"},"c10101070":{n:"雷州"},"c10101065":{n:"吴川"}},"c10101012":{n:"茂名","c10101222":{n:"市辖区"},"c10101094":{n:"电白"},"c10101024":{n:"高州"},"c10101027":{n:"化州"},"c10101032":{n:"信宜"}},"c10101006":{n:"肇庆","c10101223":{n:"市辖区"},"c10101056":{n:"广宁"},"c10101086":{n:"怀集"},"c10101054":{n:"封开"},"c10101091":{n:"德庆"},"c10101079":{n:"高要"},"c10101051":{n:"四会"}},"c10101008":{n:"惠州","c10101224":{n:"市辖区"},"c10101035":{n:"博罗"},"c10101097":{n:"惠东"},"c10101069":{n:"龙门"}},"c10101014":{n:"梅州","c10101225":{n:"市辖区"},"c10101074":{n:"梅县"},"c10101076":{n:"大埔"},"c10101048":{n:"丰顺"},"c10101082":{n:"五华"},"c10101087":{n:"平远"},"c10101043":{n:"蕉岭"},"c10101025":{n:"兴宁"}},"c10101028":{n:"汕尾","c10101226":{n:"市辖区"},"c10101009":{n:"海丰"},"c10101059":{n:"陆河"},"c10101096":{n:"陆丰"}},"c10101023":{n:"河源","c10101227":{n:"市辖区"},"c10101083":{n:"紫金"},"c10101049":{n:"龙川"},"c10101044":{n:"连平"},"c10101077":{n:"和平"},"c10101228":{n:"东源"}},"c10101022":{n:"阳江","c10101229":{n:"市辖区"},"c10101073":{n:"阳西"},"c10101039":{n:"阳东"},"c10101030":{n:"阳春"}},"c10101018":{n:"清远","c10101230":{n:"市辖区"},"c10101088":{n:"佛冈"},"c10101058":{n:"阳山"},"c10101093":{n:"连山"},"c10101095":{n:"连南"},"c10101231":{n:"清新"},"c10101019":{n:"英德"},"c10101062":{n:"连州"}},"c10101007":{n:"东莞","c10101232":{n:"市辖区"}},"c10101011":{n:"中山","c10101233":{n:"市辖区"}},"c10101020":{n:"潮州","c10101234":{n:"市辖区"},"c10101046":{n:"潮安"},"c10101080":{n:"饶平"}},"c10101026":{n:"揭阳","c10101235":{n:"市辖区"},"c10101075":{n:"揭东"},"c10101081":{n:"揭西"},"c10101047":{n:"惠来"},"c10101034":{n:"普宁"}},"c10101068":{n:"云浮","c10101236":{n:"市辖区"},"c10101042":{n:"新兴"},"c10101072":{n:"郁南"},"c10101237":{n:"云安"},"c10101038":{n:"罗定"}}},"c10118000":{n:"江苏","c10118001":{n:"南京","c10118075":{n:"玄武区"},"c10118076":{n:"白下区"},"c10118077":{n:"秦淮区"},"c10118078":{n:"建邺区"},"c10118079":{n:"鼓楼区"},"c10118080":{n:"下关区"},"c10118081":{n:"浦口区"},"c10118082":{n:"栖霞区"},"c10118083":{n:"雨花台区"},"c10118025":{n:"江宁区"},"c10118052":{n:"六合区"},"c10118030":{n:"溧水"},"c10118056":{n:"高淳"}},"c10118003":{n:"无锡","c10118084":{n:"市辖区"},"c10118015":{n:"江阴"},"c10118014":{n:"宜兴"}},"c10118004":{n:"徐州","c10118085":{n:"市辖区"},"c10118039":{n:"丰县"},"c10118067":{n:"沛县"},"c10118045":{n:"睢宁"},"c10118071":{n:"新沂"},"c10118086":{n:"邳州"}},"c10118005":{n:"常州","c10118087":{n:"市辖区"},"c10118072":{n:"溧阳"},"c10118043":{n:"金坛"}},"c10118002":{n:"苏州","c10118088":{n:"市辖区"},"c10118017":{n:"常熟"},"c10118013":{n:"张家港"},"c10118012":{n:"昆山"},"c10118019":{n:"吴江"},"c10118020":{n:"太仓"}},"c10118011":{n:"南通","c10118089":{n:"市辖区"},"c10118036":{n:"海安"},"c10118055":{n:"如东"},"c10118062":{n:"启东"},"c10118028":{n:"如皋"},"c10118033":{n:"海门"}},"c10118007":{n:"连云港","c10118090":{n:"市辖区"},"c10118061":{n:"赣榆"},"c10118032":{n:"东海"},"c10118035":{n:"灌云"},"c10118065":{n:"灌南"}},"c10118016":{n:"淮安","c10118091":{n:"市辖区"},"c10118054":{n:"涟水"},"c10118049":{n:"洪泽"},"c10118027":{n:"盱眙"},"c10118023":{n:"金湖"}},"c10118009":{n:"盐城","c10118092":{n:"市辖区"},"c10118048":{n:"响水"},"c10118022":{n:"滨海"},"c10118053":{n:"阜宁"},"c10118026":{n:"射阳"},"c10118057":{n:"建湖"},"c10118060":{n:"东台"},"c10118031":{n:"大丰"}},"c10118010":{n:"扬州","c10118093":{n:"市辖区"},"c10118047":{n:"宝应"},"c10118044":{n:"仪征"},"c10118073":{n:"高邮"}},"c10118006":{n:"镇江","c10118094":{n:"市辖区"},"c10118070":{n:"丹阳"},"c10118074":{n:"扬中"},"c10118046":{n:"句容"}},"c10118051":{n:"泰州","c10118095":{n:"市辖区"},"c10118059":{n:"兴化"},"c10118024":{n:"靖江"},"c10118018":{n:"泰兴"},"c10118029":{n:"姜堰"}},"c10118063":{n:"宿迁","c10118096":{n:"市辖区"},"c10118034":{n:"沭阳"},"c10118037":{n:"泗阳"},"c10118066":{n:"泗洪"}}},"c10131000":{n:"浙江","c10131001":{n:"杭州","c10131080":{n:"上城区"},"c10131081":{n:"下城区"},"c10131082":{n:"江干区"},"c10131083":{n:"拱墅区"},"c10131084":{n:"西湖区"},"c10131085":{n:"滨江区"},"c10131077":{n:"萧山区"},"c10131067":{n:"余杭区"},"c10131073":{n:"桐庐"},"c10131069":{n:"淳安"},"c10131040":{n:"建德"},"c10131020":{n:"富阳"},"c10131044":{n:"临安"}},"c10131003":{n:"宁波","c10131086":{n:"海曙区"},"c10131087":{n:"江东区"},"c10131088":{n:"江北区"},"c10131089":{n:"北仑区"},"c10131039":{n:"镇海区"},"c10131090":{n:"鄞州区"},"c10131051":{n:"象山"},"c10131021":{n:"宁海"},"c10131071":{n:"余姚"},"c10131042":{n:"慈溪"},"c10131047":{n:"奉化"}},"c10131002":{n:"温州","c10131091":{n:"市辖区"},"c10131030":{n:"洞头"},"c10131026":{n:"永嘉"},"c10131034":{n:"平阳"},"c10131066":{n:"苍南"},"c10131068":{n:"文成"},"c10131037":{n:"泰顺"},"c10131019":{n:"瑞安"},"c10131057":{n:"乐清"}},"c10131006":{n:"嘉兴","c10131092":{n:"市辖区"},"c10131061":{n:"嘉善"},"c10131033":{n:"海盐"},"c10131036":{n:"海宁"},"c10131065":{n:"平湖"},"c10131029":{n:"桐乡"}},"c10131005":{n:"湖州","c10131093":{n:"市辖区"},"c10131023":{n:"德清"},"c10131025":{n:"长兴"},"c10131053":{n:"安吉"}},"c10131004":{n:"绍兴","c10131094":{n:"市辖区"},"c10131095":{n:"绍兴县"},"c10131032":{n:"新昌"},"c10131063":{n:"诸暨"},"c10131028":{n:"上虞"},"c10131059":{n:"嵊州"}},"c10131009":{n:"金华","c10131097":{n:"市辖区"},"c10131038":{n:"武义"},"c10131035":{n:"浦江"},"c10131041":{n:"磐安"},"c10131018":{n:"兰溪"},"c10131013":{n:"义乌"},"c10131064":{n:"东阳"},"c10131016":{n:"永康"}},"c10131011":{n:"衢州","c10131098":{n:"市辖区"},"c10131027":{n:"常山"},"c10131058":{n:"开化"},"c10131062":{n:"龙游"},"c10131055":{n:"江山"}},"c10131015":{n:"舟山","c10131099":{n:"市辖区"},"c10131046":{n:"岱山"},"c10131079":{n:"嵊泗"}},"c10131012":{n:"台州","c10131100":{n:"市辖区"},"c10131074":{n:"玉环"},"c10131049":{n:"三门"},"c10131078":{n:"天台"},"c10131045":{n:"仙居"},"c10131014":{n:"温岭"},"c10131007":{n:"临海"}},"c10131010":{n:"丽水","c10131101":{n:"市辖区"},"c10131043":{n:"青田"},"c10131072":{n:"缙云"},"c10131052":{n:"遂昌"},"c10131024":{n:"松阳"},"c10131076":{n:"云和"},"c10131048":{n:"庆元"},"c10131056":{n:"景宁"},"c10131022":{n:"龙泉"}}},"c10127000":{n:"四川","c10127001":{n:"成都","c10127138":{n:"锦江区"},"c10127139":{n:"青羊区"},"c10127140":{n:"金牛区"},"c10127141":{n:"武侯区"},"c10127142":{n:"成华区"},"c10127143":{n:"龙泉驿区"},"c10127144":{n:"青白江区"},"c10127116":{n:"新都区"},"c10127094":{n:"温江区"},"c10127040":{n:"金堂"},"c10127103":{n:"双流"},"c10127054":{n:"郫县"},"c10127129":{n:"大邑"},"c10127109":{n:"蒲江"},"c10127048":{n:"新津"},"c10127019":{n:"都江堰"},"c10127061":{n:"彭州"},"c10127077":{n:"邛崃"},"c10127069":{n:"崇州"}},"c10127014":{n:"自贡","c10127145":{n:"市辖区"},"c10127090":{n:"荣县"},"c10127030":{n:"富顺"}},"c10127017":{n:"攀枝花","c10127146":{n:"市辖区"},"c10127043":{n:"米易"},"c10127106":{n:"盐边"}},"c10127016":{n:"泸州","c10127147":{n:"市辖区"},"c10127148":{n:"泸县"},"c10127091":{n:"合江"},"c10127100":{n:"叙永"},"c10127045":{n:"古蔺"}},"c10127018":{n:"德阳","c10127149":{n:"市辖区"},"c10127075":{n:"中江"},"c10127150":{n:"罗江"},"c10127121":{n:"广汉"},"c10127067":{n:"什邡"},"c10127127":{n:"绵竹"}},"c10127005":{n:"绵阳","c10127151":{n:"市辖区"},"c10127119":{n:"三台"},"c10127065":{n:"盐亭"},"c10127044":{n:"安县"},"c10127058":{n:"梓潼"},"c10127152":{n:"北川"},"c10127099":{n:"平武"},"c10127020":{n:"江油"}},"c10127010":{n:"广元","c10127153":{n:"市辖区"},"c10127028":{n:"旺苍"},"c10127088":{n:"青川"},"c10127082":{n:"剑阁"},"c10127035":{n:"苍溪"}},"c10127117":{n:"遂宁","c10127154":{n:"市辖区"},"c10127062":{n:"蓬溪"},"c10127123":{n:"射洪"},"c10127192":{n:"大英"}},"c10127013":{n:"内江","c10127155":{n:"市辖区"},"c10127096":{n:"威远"},"c10127027":{n:"资中"},"c10127042":{n:"隆昌"}},"c10127002":{n:"乐山","c10127156":{n:"市辖区"},"c10127092":{n:"犍为"},"c10127124":{n:"井研"},"c10127038":{n:"夹江"},"c10127131":{n:"沐川"},"c10127111":{n:"峨边"},"c10127031":{n:"马边"},"c10127022":{n:"峨眉山"}},"c10127011":{n:"南充","c10127157":{n:"市辖区"},"c10127133":{n:"南部"},"c10127026":{n:"营山"},"c10127087":{n:"蓬安"},"c10127033":{n:"仪陇"},"c10127073":{n:"西充"},"c10127081":{n:"阆中"}},"c10127056":{n:"眉山","c10127158":{n:"市辖区"},"c10127063":{n:"仁寿"},"c10127079":{n:"彭山"},"c10127071":{n:"洪雅"},"c10127085":{n:"丹棱"},"c10127024":{n:"青神"}},"c10127015":{n:"宜宾","c10127160":{n:"市辖区"},"c10127161":{n:"宜宾县"},"c10127134":{n:"江安"},"c10127120":{n:"长宁"},"c10127126":{n:"高县"},"c10127066":{n:"珙县"},"c10127074":{n:"筠连"},"c10127059":{n:"兴文"},"c10127113":{n:"屏山"}},"c10127070":{n:"广安","c10127162":{n:"市辖区"},"c10127130":{n:"岳池"},"c10127078":{n:"武胜"},"c10127084":{n:"邻水"},"c10127023":{n:"华蓥"}},"c10127137":{n:"达州","c10127163":{n:"市辖区"},"c10127012":{n:"达县"},"c10127041":{n:"宣汉"},"c10127104":{n:"开江"},"c10127110":{n:"大竹"},"c10127055":{n:"渠县"},"c10127049":{n:"万源"}},"c10127008":{n:"雅安","c10127164":{n:"市辖区"},"c10127083":{n:"名山"},"c10127029":{n:"荥经"},"c10127089":{n:"汉源"},"c10127039":{n:"石棉"},"c10127036":{n:"天全"},"c10127098":{n:"芦山"},"c10127093":{n:"宝兴"}},"c10127125":{n:"巴中","c10127165":{n:"市辖区"},"c10127118":{n:"通江"},"c10127064":{n:"南江"},"c10127057":{n:"平昌"}},"c10127021":{n:"资阳","c10127166":{n:"市辖区"},"c10127167":{n:"安岳"},"c10127105":{n:"乐至"},"c10127034":{n:"简阳"}},"c10127007":{n:"阿坝","c10127006":{n:"汶川"},"c10127025":{n:"理县"},"c10127168":{n:"茂县"},"c10127107":{n:"松潘"},"c10127169":{n:"九寨沟"},"c10127170":{n:"金川"},"c10127171":{n:"小金"},"c10127172":{n:"黑水"},"c10127114":{n:"马尔康"},"c10127173":{n:"壤塘"},"c10127194":{n:"阿坝县"},"c10127174":{n:"若尔盖"},"c10127175":{n:"红原"}},"c10127009":{n:"甘孜","c10127052":{n:"康定"},"c10127176":{n:"泸定"},"c10127177":{n:"丹巴"},"c10127195":{n:"九龙"},"c10127178":{n:"雅江"},"c10127179":{n:"道孚"},"c10127180":{n:"炉霍"},"c10127193":{n:"甘孜县"},"c10127181":{n:"新龙"},"c10127182":{n:"德格"},"c10127183":{n:"白玉"},"c10127184":{n:"石渠"},"c10127185":{n:"色达"},"c10127186":{n:"理塘"},"c10127187":{n:"巴塘"},"c10127188":{n:"乡城"},"c10127189":{n:"稻城"},"c10127190":{n:"得荣"}},"c10127003":{n:"凉山","c10127046":{n:"西昌"},"c10127102":{n:"木里"},"c10127112":{n:"盐源"},"c10127191":{n:"德昌"},"c10127047":{n:"会理"},"c10127108":{n:"会东"},"c10127050":{n:"宁南"},"c10127068":{n:"普格"},"c10127128":{n:"布拖"},"c10127076":{n:"金阳"},"c10127086":{n:"昭觉"},"c10127122":{n:"喜德"},"c10127053":{n:"冕宁"},"c10127115":{n:"越西"},"c10127032":{n:"甘洛"},"c10127135":{n:"美姑"},"c10127060":{n:"雷波"}}},"c10107000":{n:"福建","c10107001":{n:"福州","c10107069":{n:"鼓楼区"},"c10107070":{n:"台江区"},"c10107071":{n:"仓山区"},"c10107072":{n:"马尾区"},"c10107073":{n:"晋安区"},"c10107045":{n:"闽侯"},"c10107018":{n:"连江"},"c10107030":{n:"罗源"},"c10107057":{n:"闽清"},"c10107027":{n:"永泰"},"c10107054":{n:"平潭"},"c10107023":{n:"福清"},"c10107050":{n:"长乐"}},"c10107002":{n:"厦门","c10107074":{n:"思明区"},"c10107075":{n:"海沧区"},"c10107076":{n:"湖里区"},"c10107077":{n:"集美区"},"c10107033":{n:"同安区"},"c10107078":{n:"翔安区"}},"c10107010":{n:"莆田","c10107079":{n:"市辖区"},"c10107025":{n:"仙游"}},"c10107009":{n:"三明","c10107080":{n:"市辖区"},"c10107056":{n:"明溪"},"c10107053":{n:"清流"},"c10107026":{n:"宁化"},"c10107049":{n:"大田"},"c10107017":{n:"尤溪"},"c10107044":{n:"沙县"},"c10107032":{n:"将乐"},"c10107060":{n:"泰宁"},"c10107029":{n:"建宁"},"c10107022":{n:"永安"}},"c10107003":{n:"泉州","c10107081":{n:"市辖区"},"c10107064":{n:"惠安"},"c10107031":{n:"安溪"},"c10107062":{n:"永春"},"c10107035":{n:"德化"},"c10107082":{n:"金门"},"c10107012":{n:"石狮"},"c10107011":{n:"晋江"},"c10107059":{n:"南安"}},"c10107007":{n:"漳州","c10107083":{n:"市辖区"},"c10107024":{n:"云霄"},"c10107051":{n:"漳浦"},"c10107028":{n:"诏安"},"c10107046":{n:"长泰"},"c10107055":{n:"东山"},"c10107041":{n:"南靖"},"c10107058":{n:"平和"},"c10107014":{n:"华安"},"c10107019":{n:"龙海"}},"c10107004":{n:"南平","c10107084":{n:"市辖区"},"c10107065":{n:"顺昌"},"c10107042":{n:"浦城"},"c10107020":{n:"光泽"},"c10107015":{n:"松溪"},"c10107047":{n:"政和"},"c10107005":{n:"邵武"},"c10107052":{n:"武夷山"},"c10107036":{n:"建瓯"},"c10107038":{n:"建阳"}},"c10107008":{n:"龙岩","c10107085":{n:"市辖区"},"c10107067":{n:"长汀"},"c10107034":{n:"永定"},"c10107063":{n:"上杭"},"c10107037":{n:"武平"},"c10107040":{n:"连城"},"c10107061":{n:"漳平"}},"c10107013":{n:"宁德","c10107086":{n:"市辖区"},"c10107068":{n:"霞浦"},"c10107016":{n:"古田"},"c10107048":{n:"屏南"},"c10107043":{n:"寿宁"},"c10107021":{n:"周宁"},"c10107066":{n:"柘荣"},"c10107006":{n:"福安"},"c10107039":{n:"福鼎"}}},"c10124000":{n:"山东","c10124003":{n:"济南","c10124112":{n:"历下区"},"c10124113":{n:"市中区"},"c10124114":{n:"槐荫区"},"c10124115":{n:"天桥区"},"c10124116":{n:"历城区"},"c10124029":{n:"长清区"},"c10124043":{n:"平阴"},"c10124088":{n:"济阳"},"c10124036":{n:"商河"},"c10124082":{n:"章丘"}},"c10124001":{n:"青岛","c10124117":{n:"市南区"},"c10124118":{n:"市北区"},"c10124119":{n:"四方区"},"c10124120":{n:"黄岛区"},"c10124121":{n:"崂山区"},"c10124122":{n:"李沧区"},"c10124123":{n:"城阳区"},"c10124099":{n:"胶州"},"c10124062":{n:"即墨"},"c10124055":{n:"平度"},"c10124048":{n:"胶南"},"c10124104":{n:"莱西"}},"c10124004":{n:"淄博","c10124124":{n:"市辖区"},"c10124069":{n:"桓台"},"c10124022":{n:"高青"},"c10124075":{n:"沂源"}},"c10124014":{n:"枣庄","c10124125":{n:"市辖区"},"c10124054":{n:"滕州"}},"c10124007":{n:"东营","c10124126":{n:"市辖区"},"c10124035":{n:"垦利"},"c10124028":{n:"利津"},"c10124081":{n:"广饶"}},"c10124009":{n:"烟台","c10124127":{n:"市辖区"},"c10124025":{n:"长岛"},"c10124030":{n:"龙口"},"c10124020":{n:"莱阳"},"c10124077":{n:"莱州"},"c10124083":{n:"蓬莱"},"c10124066":{n:"招远"},"c10124037":{n:"栖霞"},"c10124073":{n:"海阳"}},"c10124008":{n:"潍坊","c10124128":{n:"市辖区"},"c10124063":{n:"临朐"},"c10124070":{n:"昌乐"},"c10124110":{n:"青州"},"c10124056":{n:"诸城"},"c10124095":{n:"寿光"},"c10124105":{n:"安丘"},"c10124100":{n:"高密"},"c10124049":{n:"昌邑"}},"c10124015":{n:"济宁","c10124129":{n:"市辖区"},"c10124087":{n:"微山"},"c10124041":{n:"鱼台"},"c10124093":{n:"金乡"},"c10124046":{n:"嘉祥"},"c10124053":{n:"汶上"},"c10124098":{n:"泗水"},"c10124076":{n:"梁山"},"c10124017":{n:"曲阜"},"c10124010":{n:"兖州"},"c10124034":{n:"邹城"}},"c10124011":{n:"泰安","c10124130":{n:"市辖区"},"c10124108":{n:"宁阳"},"c10124067":{n:"东平"},"c10124060":{n:"新泰"},"c10124021":{n:"肥城"}},"c10124002":{n:"威海","c10124131":{n:"市辖区"},"c10124094":{n:"文登"},"c10124042":{n:"荣成"},"c10124047":{n:"乳山"}},"c10124016":{n:"日照","c10124132":{n:"市辖区"},"c10124061":{n:"五莲"},"c10124133":{n:"莒县"}},"c10124068":{n:"莱芜","c10124134":{n:"市辖区"}},"c10124013":{n:"临沂","c10124135":{n:"市辖区"},"c10124038":{n:"沂南"},"c10124096":{n:"郯城"},"c10124084":{n:"沂水"},"c10124026":{n:"苍山"},"c10124050":{n:"费县"},"c10124078":{n:"平邑"},"c10124090":{n:"莒南"},"c10124031":{n:"蒙阴"},"c10124044":{n:"临沭"}},"c10124006":{n:"德州","c10124136":{n:"市辖区"},"c10124059":{n:"陵县"},"c10124092":{n:"宁津"},"c10124080":{n:"庆云"},"c10124137":{n:"临邑"},"c10124045":{n:"齐河"},"c10124040":{n:"平原"},"c10124086":{n:"夏津"},"c10124052":{n:"武城"},"c10124097":{n:"乐陵"},"c10124103":{n:"禹城"}},"c10124005":{n:"聊城","c10124138":{n:"市辖区"},"c10124085":{n:"阳谷"},"c10124039":{n:"莘县"},"c10124027":{n:"茌平"},"c10124032":{n:"东阿"},"c10124091":{n:"冠县"},"c10124079":{n:"高唐"},"c10124074":{n:"临清"}},"c10124018":{n:"滨州","c10124139":{n:"市辖区"},"c10124064":{n:"惠民"},"c10124023":{n:"阳信"},"c10124111":{n:"无棣"},"c10124071":{n:"沾化"},"c10124057":{n:"博兴"},"c10124106":{n:"邹平"}},"c10124012":{n:"菏泽","c10124140":{n:"市辖区"},"c10124065":{n:"曹县"},"c10124107":{n:"单县"},"c10124058":{n:"成武"},"c10124051":{n:"巨野"},"c10124024":{n:"郓城"},"c10124072":{n:"鄄城"},"c10124102":{n:"定陶"},"c10124019":{n:"东明"}}},"c10115000":{n:"湖北","c10115001":{n:"武汉","c10115086":{n:"江岸区"},"c10115087":{n:"江汉区"},"c10115088":{n:"硚口区"},"c10115089":{n:"汉阳区"},"c10115072":{n:"武昌区"},"c10115090":{n:"青山区"},"c10115091":{n:"洪山区"},"c10115092":{n:"东西湖区"},"c10115093":{n:"汉南区"},"c10115077":{n:"蔡甸区"},"c10115094":{n:"江夏区"},"c10115043":{n:"黄陂区"},"c10115080":{n:"新洲区"}},"c10115002":{n:"黄石","c10115095":{n:"市辖区"},"c10115039":{n:"阳新"},"c10115073":{n:"大冶"}},"c10115007":{n:"十堰","c10115096":{n:"市辖区"},"c10115045":{n:"郧县"},"c10115058":{n:"郧西"},"c10115054":{n:"竹山"},"c10115021":{n:"竹溪"},"c10115049":{n:"房县"},"c10115082":{n:"丹江口"}},"c10115008":{n:"宜昌","c10115097":{n:"市辖区"},"c10115042":{n:"远安"},"c10115023":{n:"兴山"},"c10115056":{n:"秭归"},"c10115051":{n:"长阳"},"c10115018":{n:"五峰"},"c10115098":{n:"宜都"},"c10115079":{n:"当阳"},"c10115047":{n:"枝江"}},"c10115014":{n:"襄阳","c10115099":{n:"市辖区"},"c10115019":{n:"南漳"},"c10115057":{n:"谷城"},"c10115029":{n:"保康"},"c10115060":{n:"老河口"},"c10115024":{n:"枣阳"},"c10115052":{n:"宜城"}},"c10115004":{n:"鄂州","c10115100":{n:"市辖区"}},"c10115012":{n:"荆门","c10115101":{n:"市辖区"},"c10115070":{n:"京山"},"c10115102":{n:"沙洋"},"c10115033":{n:"钟祥"}},"c10115013":{n:"孝感","c10115103":{n:"市辖区"},"c10115104":{n:"孝昌"},"c10115069":{n:"大悟"},"c10115041":{n:"云梦"},"c10115075":{n:"应城"},"c10115078":{n:"安陆"},"c10115036":{n:"汉川"}},"c10115010":{n:"荆州","c10115105":{n:"市辖区"},"c10115030":{n:"公安"},"c10115025":{n:"监利"},"c10115106":{n:"江陵"},"c10115061":{n:"石首"},"c10115037":{n:"洪湖"},"c10115065":{n:"松滋"}},"c10115011":{n:"黄冈","c10115107":{n:"市辖区"},"c10115108":{n:"团风"},"c10115055":{n:"红安"},"c10115059":{n:"罗田"},"c10115027":{n:"英山"},"c10115022":{n:"浠水"},"c10115063":{n:"蕲春"},"c10115031":{n:"黄梅"},"c10115017":{n:"麻城"},"c10115067":{n:"武穴"}},"c10115006":{n:"咸宁","c10115109":{n:"市辖区"},"c10115053":{n:"嘉鱼"},"c10115048":{n:"通城"},"c10115081":{n:"崇阳"},"c10115044":{n:"通山"},"c10115110":{n:"赤壁"}},"c10115062":{n:"随州","c10115111":{n:"市辖区"},"c10115112":{n:"随县"},"c10115046":{n:"广水"}},"c10115009":{n:"恩施","c10115113":{n:"恩施市"},"c10115040":{n:"利川"},"c10115028":{n:"建始"},"c10115064":{n:"巴东"},"c10115068":{n:"宣恩"},"c10115074":{n:"咸丰"},"c10115035":{n:"来凤"},"c10115032":{n:"鹤峰"}},"c10115085":{n:"省直辖县级","c10115066":{n:"仙桃"},"c10115071":{n:"潜江"},"c10115034":{n:"天门"},"c10115016":{n:"神农架"}}},"c10112000":{n:"河北","c10112001":{n:"石家庄","c10112145":{n:"长安区"},"c10112146":{n:"桥东区"},"c10112147":{n:"桥西区"},"c10112148":{n:"新华区"},"c10112149":{n:"井陉矿区"},"c10112150":{n:"裕华区"},"c10112050":{n:"井陉"},"c10112042":{n:"正定"},"c10112110":{n:"栾城"},"c10112097":{n:"行唐"},"c10112030":{n:"灵寿"},"c10112021":{n:"高邑"},"c10112067":{n:"深泽"},"c10112083":{n:"赞皇"},"c10112127":{n:"无极"},"c10112089":{n:"平山"},"c10112119":{n:"元氏"},"c10112012":{n:"赵县"},"c10112136":{n:"辛集"},"c10112151":{n:"藁城"},"c10112075":{n:"晋州"},"c10112059":{n:"新乐"},"c10112152":{n:"鹿泉"}},"c10112006":{n:"唐山","c10112153":{n:"市辖区"},"c10112104":{n:"滦县"},"c10112112":{n:"滦南"},"c10112061":{n:"乐亭"},"c10112138":{n:"迁西"},"c10112036":{n:"玉田"},"c10112052":{n:"唐海"},"c10112044":{n:"遵化"},"c10112068":{n:"迁安"}},"c10112008":{n:"秦皇岛","c10112154":{n:"市辖区"},"c10112101":{n:"青龙"},"c10112025":{n:"昌黎"},"c10112034":{n:"抚宁"},"c10112093":{n:"卢龙"}},"c10112004":{n:"邯郸","c10112155":{n:"市辖区"},"c10112156":{n:"邯郸县"},"c10112096":{n:"临漳"},"c10112046":{n:"成安"},"c10112070":{n:"大名"},"c10112105":{n:"涉县"},"c10112038":{n:"磁县"},"c10112016":{n:"肥乡"},"c10112114":{n:"永年"},"c10112063":{n:"邱县"},"c10112054":{n:"鸡泽"},"c10112078":{n:"广平"},"c10112131":{n:"馆陶"},"c10112140":{n:"魏县"},"c10112123":{n:"曲周"},"c10112029":{n:"武安"}},"c10112003":{n:"邢台","c10112158":{n:"市辖区"},"c10112170":{n:"邢台县"},"c10112033":{n:"临城"},"c10112092":{n:"内丘"},"c10112100":{n:"柏乡"},"c10112109":{n:"隆尧"},"c10112082":{n:"任县"},"c10112144":{n:"南和"},"c10112041":{n:"宁晋"},"c10112049":{n:"巨鹿"},"c10112118":{n:"新河"},"c10112135":{n:"广宗"},"c10112074":{n:"平乡"},"c10112066":{n:"威县"},"c10112126":{n:"清河"},"c10112024":{n:"临西"},"c10112058":{n:"南宫"},"c10112020":{n:"沙河"}},"c10112010":{n:"保定","c10112159":{n:"市辖区"},"c10112160":{n:"满城"},"c10112047":{n:"清苑"},"c10112115":{n:"涞水"},"c10112094":{n:"阜平"},"c10112103":{n:"徐水"},"c10112132":{n:"定兴"},"c10112064":{n:"唐县"},"c10112035":{n:"高阳"},"c10112043":{n:"容城"},"c10112124":{n:"涞源"},"c10112120":{n:"望都"},"c10112051":{n:"安新"},"c10112055":{n:"易县"},"c10112026":{n:"曲阳"},"c10112060":{n:"蠡县"},"c10112128":{n:"顺平"},"c10112079":{n:"博野"},"c10112111":{n:"雄县"},"c10112071":{n:"涿州"},"c10112086":{n:"定州"},"c10112017":{n:"安国"},"c10112141":{n:"高碑店"}},"c10112011":{n:"张家口","c10112161":{n:"市辖区"},"c10112137":{n:"宣化"},"c10112084":{n:"张北"},"c10112098":{n:"康保"},"c10112090":{n:"沽源"},"c10112031":{n:"尚义"},"c10112116":{n:"蔚县"},"c10112056":{n:"阳原"},"c10112076":{n:"怀安"},"c10112013":{n:"万全"},"c10112107":{n:"怀来"},"c10112048":{n:"涿鹿"},"c10112039":{n:"赤城"},"c10112022":{n:"崇礼"}},"c10112009":{n:"承德","c10112162":{n:"市辖区"},"c10112163":{n:"承德县"},"c10112133":{n:"兴隆"},"c10112080":{n:"平泉"},"c10112027":{n:"滦平"},"c10112072":{n:"隆化"},"c10112087":{n:"丰宁"},"c10112018":{n:"宽城"},"c10112142":{n:"围场"}},"c10112005":{n:"沧州","c10112164":{n:"市辖区"},"c10112165":{n:"沧县"},"c10112134":{n:"青县"},"c10112143":{n:"东光"},"c10112057":{n:"海兴"},"c10112125":{n:"盐山"},"c10112028":{n:"肃宁"},"c10112073":{n:"南皮"},"c10112081":{n:"吴桥"},"c10112037":{n:"献县"},"c10112065":{n:"孟村"},"c10112019":{n:"泊头"},"c10112095":{n:"任丘"},"c10112117":{n:"黄骅"},"c10112088":{n:"河间"}},"c10112007":{n:"廊坊","c10112166":{n:"市辖区"},"c10112032":{n:"固安"},"c10112085":{n:"永清"},"c10112099":{n:"香河"},"c10112023":{n:"大城"},"c10112091":{n:"文安"},"c10112040":{n:"大厂"},"c10112014":{n:"霸州"},"c10112108":{n:"三河"}},"c10112002":{n:"衡水","c10112167":{n:"市辖区"},"c10112069":{n:"枣强"},"c10112053":{n:"武邑"},"c10112113":{n:"武强"},"c10112168":{n:"饶阳"},"c10112015":{n:"安平"},"c10112130":{n:"故城"},"c10112062":{n:"景县"},"c10112122":{n:"阜城"},"c10112169":{n:"冀州"},"c10112077":{n:"深州"}}},"c10125000":{n:"山西","c10125001":{n:"太原","c10125109":{n:"小店区"},"c10125110":{n:"迎泽区"},"c10125111":{n:"杏花岭区"},"c10125112":{n:"尖草坪区"},"c10125113":{n:"万柏林区"},"c10125114":{n:"晋源区"},"c10125102":{n:"清徐"},"c10125096":{n:"阳曲"},"c10125050":{n:"娄烦"},"c10125057":{n:"古交"}},"c10125005":{n:"大同","c10125115":{n:"市辖区"},"c10125070":{n:"阳高"},"c10125019":{n:"天镇"},"c10125075":{n:"广灵"},"c10125030":{n:"灵丘"},"c10125024":{n:"浑源"},"c10125080":{n:"左云"},"c10125064":{n:"大同县"}},"c10125009":{n:"阳泉","c10125116":{n:"市辖区"},"c10125041":{n:"平定"},"c10125086":{n:"盂县"}},"c10125010":{n:"长治","c10125117":{n:"市辖区"},"c10125118":{n:"长治县"},"c10125042":{n:"襄垣"},"c10125055":{n:"屯留"},"c10125035":{n:"平顺"},"c10125087":{n:"黎城"},"c10125081":{n:"壶关"},"c10125012":{n:"长子"},"c10125094":{n:"武乡"},"c10125048":{n:"沁县"},"c10125100":{n:"沁源"},"c10125062":{n:"潞城"}},"c10125011":{n:"晋城","c10125119":{n:"市辖区"},"c10125074":{n:"沁水"},"c10125022":{n:"阳城"},"c10125028":{n:"陵川"},"c10125120":{n:"泽州"},"c10125068":{n:"高平"}},"c10125034":{n:"朔州","c10125121":{n:"市辖区"},"c10125046":{n:"山阴"},"c10125040":{n:"应县"},"c10125092":{n:"右玉"},"c10125085":{n:"怀仁"}},"c10125107":{n:"晋中","c10125122":{n:"市辖区"},"c10125058":{n:"榆社"},"c10125106":{n:"左权"},"c10125054":{n:"和顺"},"c10125099":{n:"昔阳"},"c10125014":{n:"寿阳"},"c10125065":{n:"太谷"},"c10125020":{n:"祁县"},"c10125071":{n:"平遥"},"c10125047":{n:"灵石"},"c10125025":{n:"介休"}},"c10125008":{n:"运城","c10125123":{n:"市辖区"},"c10125033":{n:"临猗"},"c10125084":{n:"万荣"},"c10125098":{n:"闻喜"},"c10125039":{n:"稷山"},"c10125045":{n:"新绛"},"c10125060":{n:"绛县"},"c10125016":{n:"垣曲"},"c10125052":{n:"夏县"},"c10125079":{n:"平陆"},"c10125029":{n:"芮城"},"c10125104":{n:"永济"},"c10125091":{n:"河津"}},"c10125003":{n:"忻州","c10125124":{n:"市辖区"},"c10125105":{n:"定襄"},"c10125061":{n:"五台"},"c10125017":{n:"代县"},"c10125067":{n:"繁峙"},"c10125004":{n:"宁武"},"c10125089":{n:"静乐"},"c10125073":{n:"神池"},"c10125027":{n:"五寨"},"c10125078":{n:"岢岚"},"c10125032":{n:"河曲"},"c10125082":{n:"保德"},"c10125037":{n:"偏关"},"c10125053":{n:"原平"}},"c10125006":{n:"临汾","c10125125":{n:"市辖区"},"c10125038":{n:"曲沃"},"c10125090":{n:"翼城"},"c10125044":{n:"襄汾"},"c10125097":{n:"洪洞"},"c10125031":{n:"古县"},"c10125026":{n:"安泽"},"c10125077":{n:"浮山"},"c10125072":{n:"吉县"},"c10125021":{n:"乡宁"},"c10125083":{n:"大宁"},"c10125015":{n:"隰县"},"c10125066":{n:"永和"},"c10125059":{n:"蒲县"},"c10125103":{n:"汾西"},"c10125007":{n:"侯马"},"c10125051":{n:"霍州"}},"c10125108":{n:"吕梁","c10125126":{n:"市辖区"},"c10125049":{n:"文水"},"c10125101":{n:"交城"},"c10125069":{n:"兴县"},"c10125043":{n:"临县"},"c10125018":{n:"柳林"},"c10125036":{n:"石楼"},"c10125023":{n:"岚县"},"c10125088":{n:"方山"},"c10125063":{n:"中阳"},"c10125013":{n:"交口"},"c10125056":{n:"孝义"},"c10125095":{n:"汾阳"}}},"c10121000":{n:"内蒙古","c10121001":{n:"呼和浩特","c10121096":{n:"新城区"},"c10121097":{n:"回民区"},"c10121098":{n:"玉泉区"},"c10121099":{n:"赛罕区"},"c10121017":{n:"土默特左旗"},"c10121053":{n:"托克托"},"c10121058":{n:"和林格尔"},"c10121064":{n:"清水河"},"c10121022":{n:"武川"}},"c10121003":{n:"包头","c10121100":{n:"市辖区"},"c10121032":{n:"土默特右旗"},"c10121070":{n:"固阳"},"c10121038":{n:"达尔罕茂明安联合旗"}},"c10121005":{n:"乌海","c10121102":{n:"市辖区"}},"c10121008":{n:"赤峰","c10121103":{n:"市辖区"},"c10121014":{n:"阿鲁科尔沁旗"},"c10121023":{n:"巴林左旗"},"c10121065":{n:"巴林右旗"},"c10121028":{n:"林西"},"c10121071":{n:"克什克腾旗"},"c10121059":{n:"翁牛特旗"},"c10121033":{n:"喀喇沁旗"},"c10121054":{n:"宁城"},"c10121018":{n:"敖汉旗"}},"c10121011":{n:"通辽","c10121104":{n:"市辖区"},"c10121082":{n:"科尔沁左翼中旗"},"c10121045":{n:"科尔沁左翼后旗"},"c10121074":{n:"开鲁"},"c10121036":{n:"库伦旗"},"c10121078":{n:"奈曼旗"},"c10121042":{n:"扎鲁特旗"},"c10121087":{n:"霍林郭勒"}},"c10121092":{n:"鄂尔多斯","c10121105":{n:"市辖区"},"c10121039":{n:"达拉特旗"},"c10121043":{n:"准格尔旗"},"c10121052":{n:"鄂托克前旗"},"c10121013":{n:"鄂托克旗"},"c10121085":{n:"杭锦旗"},"c10121048":{n:"乌审旗"},"c10121080":{n:"伊金霍洛旗"}},"c10121093":{n:"呼伦贝尔","c10121106":{n:"市辖区"},"c10121025":{n:"阿荣旗"},"c10121086":{n:"莫力达瓦达斡尔族自治旗"},"c10121073":{n:"鄂伦春自治旗"},"c10121061":{n:"鄂温克族自治旗"},"c10121035":{n:"陈巴尔虎旗"},"c10121077":{n:"新巴尔虎左旗"},"c10121041":{n:"新巴尔虎右旗"},"c10121049":{n:"满洲里"},"c10121067":{n:"牙克石"},"c10121030":{n:"扎兰屯"},"c10121044":{n:"额尔古纳"},"c10121081":{n:"根河"}},"c10121094":{n:"巴彦淖尔","c10121107":{n:"市辖区"},"c10121057":{n:"五原"},"c10121021":{n:"磴口"},"c10121063":{n:"乌拉特前旗"},"c10121027":{n:"乌拉特中旗"},"c10121069":{n:"乌拉特后旗"},"c10121031":{n:"杭锦后旗"}},"c10121095":{n:"乌兰察布","c10121108":{n:"市辖区"},"c10121051":{n:"卓资"},"c10121047":{n:"化德"},"c10121016":{n:"商都"},"c10121056":{n:"兴和"},"c10121020":{n:"凉城"},"c10121062":{n:"察哈尔右翼前旗"},"c10121026":{n:"察哈尔右翼中旗"},"c10121068":{n:"察哈尔右翼后旗"},"c10121084":{n:"四子王旗"},"c10121012":{n:"丰镇"}},"c10121091":{n:"兴安盟","c10121024":{n:"乌兰浩特"},"c10121109":{n:"阿尔山"},"c10121110":{n:"科尔沁右翼前旗"},"c10121072":{n:"科尔沁右翼中旗"},"c10121066":{n:"扎赉特旗"},"c10121029":{n:"突泉"}},"c10121089":{n:"锡林郭勒盟","c10121037":{n:"二连浩特"},"c10121009":{n:"锡林浩特"},"c10121112":{n:"阿巴嘎旗"},"c10121083":{n:"苏尼特左旗"},"c10121046":{n:"苏尼特右旗"},"c10121050":{n:"东乌珠穆沁旗"},"c10121015":{n:"西乌珠穆沁旗"},"c10121010":{n:"太仆寺旗"},"c10121088":{n:"镶黄旗"},"c10121019":{n:"正镶白旗"},"c10121060":{n:"正蓝旗"},"c10121079":{n:"多伦"}},"c10121090":{n:"阿拉善盟","c10121034":{n:"阿拉善左旗"},"c10121076":{n:"阿拉善右旗"},"c10121040":{n:"额济纳旗"}}},"c10120000":{n:"辽宁","c10120001":{n:"沈阳","c10120055":{n:"和平区"},"c10120056":{n:"沈河区"},"c10120057":{n:"大东区"},"c10120058":{n:"皇姑区"},"c10120059":{n:"铁西区"},"c10120060":{n:"苏家屯区"},"c10120061":{n:"东陵区"},"c10120062":{n:"沈北新区"},"c10120063":{n:"于洪区"},"c10120026":{n:"辽中"},"c10120047":{n:"康平"},"c10120030":{n:"法库"},"c10120045":{n:"新民"}},"c10120006":{n:"大连","c10120064":{n:"中山区"},"c10120065":{n:"西岗区"},"c10120066":{n:"沙河口区"},"c10120067":{n:"甘井子区"},"c10120068":{n:"旅顺口区"},"c10120069":{n:"金州区"},"c10120020":{n:"长海"},"c10120041":{n:"瓦房店"},"c10120022":{n:"普兰店"},"c10120040":{n:"庄河"}},"c10120004":{n:"鞍山","c10120070":{n:"市辖区"},"c10120049":{n:"台安"},"c10120032":{n:"岫岩"},"c10120028":{n:"海城"}},"c10120003":{n:"抚顺","c10120071":{n:"市辖区"},"c10120072":{n:"抚顺县"},"c10120036":{n:"新宾"},"c10120015":{n:"清原"}},"c10120007":{n:"本溪","c10120073":{n:"市辖区"},"c10120074":{n:"本溪县"},"c10120019":{n:"桓仁"}},"c10120008":{n:"丹东","c10120075":{n:"市辖区"},"c10120023":{n:"宽甸"},"c10120021":{n:"东港"},"c10120043":{n:"凤城"}},"c10120009":{n:"锦州","c10120076":{n:"市辖区"},"c10120048":{n:"黑山"},"c10120031":{n:"义县"},"c10120027":{n:"凌海"},"c10120077":{n:"北镇"}},"c10120005":{n:"营口","c10120078":{n:"市辖区"},"c10120054":{n:"盖州"},"c10120035":{n:"大石桥"}},"c10120011":{n:"阜新","c10120079":{n:"市辖区"},"c10120080":{n:"阜新县"},"c10120018":{n:"彰武"}},"c10120013":{n:"辽阳","c10120081":{n:"市辖区"},"c10120082":{n:"辽阳县"},"c10120042":{n:"灯塔"}},"c10120012":{n:"盘锦","c10120083":{n:"市辖区"},"c10120033":{n:"大洼"},"c10120052":{n:"盘山"}},"c10120002":{n:"铁岭","c10120084":{n:"市辖区"},"c10120085":{n:"铁岭县"},"c10120016":{n:"西丰"},"c10120053":{n:"昌图"},"c10120038":{n:"调兵山"},"c10120034":{n:"开原"}},"c10120010":{n:"朝阳","c10120087":{n:"市辖区"},"c10120088":{n:"朝阳县"},"c10120025":{n:"建平"},"c10120050":{n:"喀喇沁左翼"},"c10120046":{n:"北票"},"c10120029":{n:"凌源"}},"c10120014":{n:"葫芦岛","c10120089":{n:"市辖区"},"c10120037":{n:"绥中"},"c10120017":{n:"建昌"},"c10120039":{n:"兴城"}}},"c10117000":{n:"吉林","c10117001":{n:"长春","c10117050":{n:"南关区"},"c10117051":{n:"宽城区"},"c10117052":{n:"朝阳区"},"c10117053":{n:"二道区"},"c10117054":{n:"绿园区"},"c10117030":{n:"双阳区"},"c10117013":{n:"农安"},"c10117033":{n:"九台"},"c10117036":{n:"榆树"},"c10117014":{n:"德惠"}},"c10117002":{n:"吉林","c10117055":{n:"市辖区"},"c10117039":{n:"永吉"},"c10117021":{n:"蛟河"},"c10117041":{n:"桦甸"},"c10117043":{n:"舒兰"},"c10117018":{n:"磐石"}},"c10117006":{n:"四平","c10117056":{n:"市辖区"},"c10117016":{n:"梨树"},"c10117057":{n:"伊通"},"c10117038":{n:"公主岭"},"c10117035":{n:"双辽"}},"c10117028":{n:"辽源","c10117058":{n:"市辖区"},"c10117031":{n:"东丰"},"c10117011":{n:"东辽"}},"c10117004":{n:"通化","c10117059":{n:"市辖区"},"c10117060":{n:"通化县"},"c10117010":{n:"辉南"},"c10117027":{n:"柳河"},"c10117005":{n:"梅河口"},"c10117020":{n:"集安"}},"c10117048":{n:"白山","c10117061":{n:"市辖区"},"c10117022":{n:"抚松"},"c10117019":{n:"靖宇"},"c10117042":{n:"长白"},"c10117040":{n:"临江"}},"c10117008":{n:"松原","c10117062":{n:"市辖区"},"c10117015":{n:"前郭尔罗斯"},"c10117037":{n:"长岭"},"c10117017":{n:"乾安"},"c10117034":{n:"扶余"}},"c10117007":{n:"白城","c10117063":{n:"市辖区"},"c10117047":{n:"镇赉"},"c10117023":{n:"通榆"},"c10117025":{n:"洮南"},"c10117045":{n:"大安"}},"c10117049":{n:"延边","c10117003":{n:"延吉"},"c10117012":{n:"图们"},"c10117029":{n:"敦化"},"c10117024":{n:"珲春"},"c10117032":{n:"龙井"},"c10117026":{n:"和龙"},"c10117046":{n:"汪清"},"c10117009":{n:"安图"}}},"c10114000":{n:"黑龙江","c10114001":{n:"哈尔滨","c10114082":{n:"道里区"},"c10114083":{n:"南岗区"},"c10114084":{n:"道外区"},"c10114085":{n:"平房区"},"c10114086":{n:"松北区"},"c10114087":{n:"香坊区"},"c10114016":{n:"呼兰区"},"c10114026":{n:"阿城区"},"c10114036":{n:"依兰"},"c10114031":{n:"方正"},"c10114079":{n:"宾县"},"c10114049":{n:"巴彦"},"c10114045":{n:"木兰"},"c10114066":{n:"通河"},"c10114035":{n:"延寿"},"c10114075":{n:"双城"},"c10114071":{n:"尚志"},"c10114012":{n:"五常"}},"c10114005":{n:"齐齐哈尔","c10114088":{n:"市辖区"},"c10114063":{n:"龙江"},"c10114023":{n:"依安"},"c10114038":{n:"泰来"},"c10114069":{n:"甘南"},"c10114034":{n:"富裕"},"c10114019":{n:"克山"},"c10114073":{n:"克东"},"c10114058":{n:"拜泉"},"c10114029":{n:"讷河"}},"c10114009":{n:"鸡西","c10114089":{n:"市辖区"},"c10114061":{n:"鸡东"},"c10114056":{n:"虎林"},"c10114027":{n:"密山"}},"c10114020":{n:"鹤岗","c10114090":{n:"市辖区"},"c10114054":{n:"萝北"},"c10114059":{n:"绥滨"}},"c10114024":{n:"双鸭山","c10114091":{n:"市辖区"},"c10114070":{n:"集贤"},"c10114064":{n:"友谊"},"c10114030":{n:"宝清"},"c10114017":{n:"饶河"}},"c10114007":{n:"大庆","c10114092":{n:"市辖区"},"c10114060":{n:"肇州"},"c10114065":{n:"肇源"},"c10114055":{n:"林甸"},"c10114025":{n:"杜尔伯特"}},"c10114042":{n:"伊春","c10114093":{n:"市辖区"},"c10114081":{n:"嘉荫"},"c10114051":{n:"铁力"}},"c10114003":{n:"佳木斯","c10114094":{n:"市辖区"},"c10114041":{n:"桦南"},"c10114050":{n:"桦川"},"c10114076":{n:"汤原"},"c10114046":{n:"抚远"},"c10114013":{n:"同江"},"c10114080":{n:"富锦"}},"c10114067":{n:"七台河","c10114095":{n:"市辖区"},"c10114032":{n:"勃利"}},"c10114004":{n:"牡丹江","c10114096":{n:"市辖区"},"c10114047":{n:"东宁"},"c10114043":{n:"林口"},"c10114018":{n:"绥芬河"},"c10114014":{n:"海林"},"c10114052":{n:"宁安"},"c10114010":{n:"穆棱"}},"c10114053":{n:"黑河","c10114097":{n:"市辖区"},"c10114028":{n:"嫩江"},"c10114022":{n:"逊克"},"c10114057":{n:"孙吴"},"c10114006":{n:"北安"},"c10114068":{n:"五大连池"}},"c10114002":{n:"绥化","c10114098":{n:"市辖区"},"c10114011":{n:"望奎"},"c10114048":{n:"兰西"},"c10114015":{n:"青冈"},"c10114039":{n:"庆安"},"c10114074":{n:"明水"},"c10114044":{n:"绥棱"},"c10114021":{n:"安达"},"c10114040":{n:"肇东"},"c10114078":{n:"海伦"}},"c10114008":{n:"大兴安岭","c10114037":{n:"呼玛"},"c10114072":{n:"塔河"},"c10114077":{n:"漠河"}}},"c10106000":{n:"安徽","c10106001":{n:"合肥","c10106081":{n:"瑶海区"},"c10106082":{n:"庐阳区"},"c10106083":{n:"蜀山区"},"c10106084":{n:"包河区"},"c10106066":{n:"长丰"},"c10106071":{n:"肥东"},"c10106033":{n:"肥西"},"c10106069":{n:"庐江"},"c10106007":{n:"巢湖"}},"c10106009":{n:"芜湖","c10106085":{n:"市辖区"},"c10106052":{n:"芜湖县"},"c10106018":{n:"繁昌"},"c10106048":{n:"南陵"},"c10106036":{n:"无为"}},"c10106003":{n:"蚌埠","c10106086":{n:"市辖区"},"c10106024":{n:"怀远"},"c10106061":{n:"五河"},"c10106056":{n:"固镇"}},"c10106002":{n:"淮南","c10106087":{n:"市辖区"},"c10106043":{n:"凤台"}},"c10106075":{n:"马鞍山","c10106088":{n:"市辖区"},"c10106039":{n:"当涂"},"c10106064":{n:"含山"},"c10106031":{n:"和县"}},"c10106042":{n:"淮北","c10106089":{n:"市辖区"},"c10106074":{n:"濉溪"}},"c10106013":{n:"铜陵","c10106090":{n:"市辖区"},"c10106091":{n:"铜陵县"}},"c10106011":{n:"安庆","c10106092":{n:"市辖区"},"c10106021":{n:"怀宁"},"c10106068":{n:"枞阳"},"c10106026":{n:"潜山"},"c10106035":{n:"太湖"},"c10106058":{n:"宿松"},"c10106063":{n:"望江"},"c10106053":{n:"岳西"},"c10106030":{n:"桐城"}},"c10106012":{n:"黄山","c10106093":{n:"市辖区"},"c10106051":{n:"歙县"},"c10106047":{n:"休宁"},"c10106014":{n:"黟县"},"c10106017":{n:"祁门"}},"c10106008":{n:"滁州","c10106094":{n:"市辖区"},"c10106041":{n:"来安"},"c10106016":{n:"全椒"},"c10106073":{n:"定远"},"c10106046":{n:"凤阳"},"c10106078":{n:"天长"},"c10106038":{n:"明光"}},"c10106005":{n:"阜阳","c10106095":{n:"市辖区"},"c10106023":{n:"临泉"},"c10106060":{n:"太和"},"c10106037":{n:"阜南"},"c10106028":{n:"颍上"},"c10106065":{n:"界首"}},"c10106004":{n:"宿州","c10106096":{n:"市辖区"},"c10106015":{n:"砀山"},"c10106050":{n:"萧县"},"c10106045":{n:"灵璧"},"c10106077":{n:"泗县"}},"c10106006":{n:"六安","c10106098":{n:"市辖区"},"c10106049":{n:"寿县"},"c10106044":{n:"霍邱"},"c10106019":{n:"舒城"},"c10106040":{n:"金寨"},"c10106076":{n:"霍山"}},"c10106072":{n:"亳州","c10106099":{n:"市辖区"},"c10106032":{n:"涡阳"},"c10106070":{n:"蒙城"},"c10106055":{n:"利辛"}},"c10106079":{n:"池州","c10106100":{n:"市辖区"},"c10106022":{n:"东至"},"c10106054":{n:"石台"},"c10106059":{n:"青阳"}},"c10106080":{n:"宣城","c10106101":{n:"市辖区"},"c10106029":{n:"郎溪"},"c10106057":{n:"广德"},"c10106067":{n:"泾县"},"c10106020":{n:"绩溪"},"c10106025":{n:"旌德"},"c10106062":{n:"宁国"}}},"c10119000":{n:"江西","c10119001":{n:"南昌","c10119089":{n:"东湖区"},"c10119090":{n:"西湖区"},"c10119091":{n:"青云谱区"},"c10119092":{n:"湾里区"},"c10119093":{n:"青山湖区"},"c10119094":{n:"南昌县"},"c10119049":{n:"新建"},"c10119054":{n:"安义"},"c10119012":{n:"进贤"}},"c10119003":{n:"景德镇","c10119095":{n:"市辖区"},"c10119016":{n:"浮梁"},"c10119053":{n:"乐平"}},"c10119007":{n:"萍乡","c10119096":{n:"市辖区"},"c10119021":{n:"莲花"},"c10119097":{n:"上栗"},"c10119098":{n:"芦溪"}},"c10119002":{n:"九江","c10119099":{n:"市辖区"},"c10119100":{n:"九江县"},"c10119084":{n:"武宁"},"c10119063":{n:"修水"},"c10119043":{n:"永修"},"c10119074":{n:"德安"},"c10119069":{n:"星子"},"c10119078":{n:"都昌"},"c10119028":{n:"湖口"},"c10119037":{n:"彭泽"},"c10119032":{n:"瑞昌"},"c10119101":{n:"共青城"}},"c10119040":{n:"新余","c10119102":{n:"市辖区"},"c10119081":{n:"分宜"}},"c10119005":{n:"鹰潭","c10119103":{n:"市辖区"},"c10119068":{n:"余江"},"c10119027":{n:"贵溪"}},"c10119008":{n:"赣州","c10119104":{n:"市辖区"},"c10119065":{n:"赣县"},"c10119076":{n:"信丰"},"c10119029":{n:"大余"},"c10119071":{n:"上犹"},"c10119034":{n:"崇义"},"c10119086":{n:"安远"},"c10119039":{n:"龙南"},"c10119080":{n:"定南"},"c10119045":{n:"全南"},"c10119056":{n:"宁都"},"c10119051":{n:"于都"},"c10119014":{n:"兴国"},"c10119048":{n:"会昌"},"c10119060":{n:"寻乌"},"c10119018":{n:"石城"},"c10119088":{n:"瑞金"},"c10119024":{n:"南康"}},"c10119009":{n:"吉安","c10119105":{n:"市辖区"},"c10119106":{n:"吉安县"},"c10119062":{n:"吉水"},"c10119026":{n:"峡江"},"c10119058":{n:"新干"},"c10119020":{n:"永丰"},"c10119067":{n:"泰和"},"c10119073":{n:"遂川"},"c10119031":{n:"万安"},"c10119083":{n:"安福"},"c10119077":{n:"永新"},"c10119042":{n:"井冈山"}},"c10119006":{n:"宜春","c10119108":{n:"市辖区"},"c10119075":{n:"奉新"},"c10119047":{n:"万载"},"c10119033":{n:"上高"},"c10119070":{n:"宜丰"},"c10119038":{n:"靖安"},"c10119011":{n:"铜鼓"},"c10119044":{n:"丰城"},"c10119085":{n:"樟树"},"c10119079":{n:"高安"}},"c10119010":{n:"抚州","c10119109":{n:"市辖区"},"c10119059":{n:"南城"},"c10119064":{n:"黎川"},"c10119023":{n:"南丰"},"c10119050":{n:"崇仁"},"c10119017":{n:"乐安"},"c10119055":{n:"宜黄"},"c10119087":{n:"金溪"},"c10119041":{n:"资溪"},"c10119046":{n:"东乡"},"c10119082":{n:"广昌"}},"c10119004":{n:"上饶","c10119110":{n:"市辖区"},"c10119111":{n:"上饶县"},"c10119061":{n:"广丰"},"c10119052":{n:"玉山"},"c10119066":{n:"铅山"},"c10119030":{n:"横峰"},"c10119057":{n:"弋阳"},"c10119015":{n:"余干"},"c10119112":{n:"鄱阳"},"c10119025":{n:"万年"},"c10119072":{n:"婺源"},"c10119035":{n:"德兴"}}},"c10113000":{n:"河南","c10113001":{n:"郑州","c10113127":{n:"中原区"},"c10113128":{n:"二七区"},"c10113129":{n:"管城回族区"},"c10113130":{n:"金水区"},"c10113073":{n:"上街区"},"c10113131":{n:"惠济区"},"c10113026":{n:"中牟"},"c10113092":{n:"巩义"},"c10113022":{n:"荥阳"},"c10113085":{n:"新密"},"c10113078":{n:"新郑"},"c10113034":{n:"登封"}},"c10113013":{n:"开封","c10113132":{n:"市辖区"},"c10113031":{n:"杞县"},"c10113089":{n:"通许"},"c10113039":{n:"尉氏"},"c10113154":{n:"开封"},"c10113082":{n:"兰考"}},"c10113009":{n:"洛阳","c10113133":{n:"市辖区"},"c10113101":{n:"孟津"},"c10113116":{n:"新安"},"c10113075":{n:"栾川"},"c10113124":{n:"嵩县"},"c10113067":{n:"汝阳"},"c10113061":{n:"宜阳"},"c10113046":{n:"洛宁"},"c10113109":{n:"伊川"},"c10113053":{n:"偃师"}},"c10113010":{n:"平顶山","c10113134":{n:"市辖区"},"c10113123":{n:"宝丰"},"c10113115":{n:"叶县"},"c10113066":{n:"鲁山"},"c10113108":{n:"郏县"},"c10113052":{n:"舞钢"},"c10113074":{n:"汝州"}},"c10113003":{n:"安阳","c10113135":{n:"市辖区"},"c10113136":{n:"安阳县"},"c10113049":{n:"汤阴"},"c10113112":{n:"滑县"},"c10113056":{n:"内黄"},"c10113104":{n:"林州"}},"c10113015":{n:"鹤壁","c10113137":{n:"市辖区"},"c10113106":{n:"浚县"},"c10113058":{n:"淇县"}},"c10113002":{n:"新乡","c10113138":{n:"市辖区"},"c10113139":{n:"新乡县"},"c10113076":{n:"获嘉"},"c10113018":{n:"原阳"},"c10113069":{n:"延津"},"c10113081":{n:"封丘"},"c10113024":{n:"长垣"},"c10113119":{n:"卫辉"},"c10113030":{n:"辉县"}},"c10113017":{n:"焦作","c10113140":{n:"市辖区"},"c10113079":{n:"修武"},"c10113094":{n:"博爱"},"c10113028":{n:"武陟"},"c10113087":{n:"温县"},"c10113043":{n:"沁阳"},"c10113141":{n:"孟州"}},"c10113016":{n:"濮阳","c10113142":{n:"市辖区"},"c10113077":{n:"清丰"},"c10113020":{n:"南乐"},"c10113071":{n:"范县"},"c10113121":{n:"台前"},"c10113155":{n:"濮阳"}},"c10113004":{n:"许昌","c10113143":{n:"市辖区"},"c10113144":{n:"许昌县"},"c10113096":{n:"鄢陵"},"c10113060":{n:"襄城"},"c10113045":{n:"禹州"},"c10113038":{n:"长葛"}},"c10113006":{n:"漯河","c10113145":{n:"市辖区"},"c10113068":{n:"舞阳"},"c10113117":{n:"临颍"}},"c10113011":{n:"三门峡","c10113147":{n:"市辖区"},"c10113084":{n:"渑池"},"c10113041":{n:"陕县"},"c10113025":{n:"卢氏"},"c10113033":{n:"义马"},"c10113091":{n:"灵宝"}},"c10113012":{n:"南阳","c10113148":{n:"市辖区"},"c10113120":{n:"南召"},"c10113050":{n:"方城"},"c10113042":{n:"西峡"},"c10113063":{n:"镇平"},"c10113019":{n:"内乡"},"c10113098":{n:"淅川"},"c10113105":{n:"社旗"},"c10113057":{n:"唐河"},"c10113113":{n:"新野"},"c10113070":{n:"桐柏"},"c10113093":{n:"邓州"}},"c10113014":{n:"商丘","c10113150":{n:"市辖区"},"c10113065":{n:"民权"},"c10113118":{n:"睢县"},"c10113062":{n:"宁陵"},"c10113111":{n:"柘城"},"c10113048":{n:"虞城"},"c10113103":{n:"夏邑"},"c10113055":{n:"永城"}},"c10113007":{n:"信阳","c10113151":{n:"市辖区"},"c10113027":{n:"罗山"},"c10113059":{n:"光山"},"c10113114":{n:"新县"},"c10113072":{n:"商城"},"c10113122":{n:"固始"},"c10113107":{n:"潢川"},"c10113064":{n:"淮滨"},"c10113021":{n:"息县"}},"c10113008":{n:"周口","c10113152":{n:"市辖区"},"c10113102":{n:"扶沟"},"c10113083":{n:"西华"},"c10113110":{n:"商水"},"c10113097":{n:"沈丘"},"c10113090":{n:"郸城"},"c10113032":{n:"淮阳"},"c10113054":{n:"太康"},"c10113040":{n:"鹿邑"},"c10113047":{n:"项城"}},"c10113005":{n:"驻马店","c10113153":{n:"市辖区"},"c10113037":{n:"西平"},"c10113095":{n:"上蔡"},"c10113044":{n:"平舆"},"c10113051":{n:"正阳"},"c10113088":{n:"确山"},"c10113023":{n:"泌阳"},"c10113029":{n:"汝南"},"c10113080":{n:"遂平"},"c10113100":{n:"新蔡"}},"c10113126":{n:"省直辖县级","c10113099":{n:"济源"}}},"c10116000":{n:"湖南","c10116001":{n:"长沙","c10116098":{n:"芙蓉区"},"c10116099":{n:"天心区"},"c10116100":{n:"岳麓区"},"c10116101":{n:"开福区"},"c10116102":{n:"雨花区"},"c10116071":{n:"望城区"},"c10116103":{n:"长沙县"},"c10116028":{n:"宁乡"},"c10116033":{n:"浏阳"}},"c10116002":{n:"株洲","c10116104":{n:"市辖区"},"c10116105":{n:"株洲县"},"c10116090":{n:"攸县"},"c10116054":{n:"茶陵"},"c10116060":{n:"炎陵"},"c10116015":{n:"醴陵"}},"c10116014":{n:"湘潭","c10116106":{n:"市辖区"},"c10116107":{n:"湘潭县"},"c10116043":{n:"湘乡"},"c10116080":{n:"韶山"}},"c10116009":{n:"衡阳","c10116108":{n:"市辖区"},"c10116109":{n:"衡阳县"},"c10116031":{n:"衡南"},"c10116036":{n:"衡山"},"c10116074":{n:"衡东"},"c10116077":{n:"祁东"},"c10116025":{n:"耒阳"},"c10116068":{n:"常宁"}},"c10116010":{n:"邵阳","c10116110":{n:"市辖区"},"c10116052":{n:"邵东"},"c10116041":{n:"新邵"},"c10116132":{n:"邵阳县"},"c10116095":{n:"隆回"},"c10116088":{n:"洞口"},"c10116084":{n:"绥宁"},"c10116037":{n:"新宁"},"c10116078":{n:"城步"},"c10116046":{n:"武冈"}},"c10116004":{n:"岳阳","c10116112":{n:"市辖区"},"c10116113":{n:"岳阳县"},"c10116093":{n:"华容"},"c10116050":{n:"湘阴"},"c10116018":{n:"平江"},"c10116062":{n:"汨罗"},"c10116057":{n:"临湘"}},"c10116005":{n:"常德","c10116114":{n:"市辖区"},"c10116081":{n:"安乡"},"c10116072":{n:"汉寿"},"c10116076":{n:"澧县"},"c10116044":{n:"临澧"},"c10116029":{n:"桃源"},"c10116034":{n:"石门"},"c10116115":{n:"津市"}},"c10116013":{n:"张家界","c10116116":{n:"市辖区"},"c10116082":{n:"慈利"},"c10116040":{n:"桑植"}},"c10116003":{n:"益阳","c10116117":{n:"市辖区"},"c10116055":{n:"南县"},"c10116048":{n:"桃江"},"c10116091":{n:"安化"},"c10116016":{n:"沅江"}},"c10116011":{n:"郴州","c10116118":{n:"市辖区"},"c10116019":{n:"桂阳"},"c10116023":{n:"宜章"},"c10116063":{n:"永兴"},"c10116094":{n:"嘉禾"},"c10116051":{n:"临武"},"c10116087":{n:"汝城"},"c10116045":{n:"桂东"},"c10116058":{n:"安仁"},"c10116083":{n:"资兴"}},"c10116075":{n:"永州","c10116119":{n:"市辖区"},"c10116079":{n:"祁阳"},"c10116038":{n:"东安"},"c10116059":{n:"双牌"},"c10116096":{n:"道县"},"c10116053":{n:"江永"},"c10116085":{n:"宁远"},"c10116047":{n:"蓝山"},"c10116042":{n:"新田"},"c10116089":{n:"江华"}},"c10116008":{n:"怀化","c10116120":{n:"市辖区"},"c10116121":{n:"中方"},"c10116070":{n:"沅陵"},"c10116027":{n:"辰溪"},"c10116056":{n:"溆浦"},"c10116022":{n:"会同"},"c10116086":{n:"麻阳"},"c10116066":{n:"新晃"},"c10116049":{n:"芷江"},"c10116061":{n:"靖州"},"c10116017":{n:"通道"},"c10116032":{n:"洪江"}},"c10116007":{n:"娄底","c10116122":{n:"市辖区"},"c10116021":{n:"双峰"},"c10116026":{n:"新化"},"c10116065":{n:"冷水江"},"c10116069":{n:"涟源"}},"c10116097":{n:"湘西","c10116006":{n:"吉首"},"c10116035":{n:"泸溪"},"c10116020":{n:"凤凰"},"c10116030":{n:"花垣"},"c10116067":{n:"保靖"},"c10116073":{n:"古丈"},"c10116024":{n:"永顺"},"c10116064":{n:"龙山"}}},"c10109000":{n:"广西","c10109001":{n:"南宁","c10109090":{n:"兴宁区"},"c10109091":{n:"青秀区"},"c10109092":{n:"江南区"},"c10109093":{n:"西乡塘区"},"c10109094":{n:"良庆区"},"c10109044":{n:"邕宁区"},"c10109011":{n:"武鸣"},"c10109065":{n:"隆安"},"c10109054":{n:"马山"},"c10109039":{n:"上林"},"c10109059":{n:"宾阳"},"c10109025":{n:"横县"}},"c10109002":{n:"柳州","c10109095":{n:"市辖区"},"c10109036":{n:"柳江"},"c10109042":{n:"柳城"},"c10109074":{n:"鹿寨"},"c10109047":{n:"融安"},"c10109086":{n:"融水"},"c10109080":{n:"三江"}},"c10109007":{n:"桂林","c10109096":{n:"市辖区"},"c10109028":{n:"阳朔"},"c10109068":{n:"临桂"},"c10109045":{n:"灵川"},"c10109084":{n:"全州"},"c10109078":{n:"兴安"},"c10109050":{n:"永福"},"c10109072":{n:"灌阳"},"c10109012":{n:"龙胜"},"c10109016":{n:"资源"},"c10109040":{n:"平乐"},"c10109034":{n:"荔浦"},"c10109055":{n:"恭城"}},"c10109008":{n:"梧州","c10109098":{n:"市辖区"},"c10109021":{n:"苍梧"},"c10109062":{n:"藤县"},"c10109070":{n:"蒙山"},"c10109026":{n:"岑溪"}},"c10109010":{n:"北海","c10109099":{n:"市辖区"},"c10109088":{n:"合浦"}},"c10109006":{n:"防城港","c10109100":{n:"市辖区"},"c10109033":{n:"上思"},"c10109101":{n:"东兴"}},"c10109003":{n:"钦州","c10109102":{n:"市辖区"},"c10109056":{n:"灵山"},"c10109017":{n:"浦北"}},"c10109014":{n:"贵港","c10109103":{n:"市辖区"},"c10109019":{n:"平南"},"c10109058":{n:"桂平"}},"c10109005":{n:"玉林","c10109104":{n:"市辖区"},"c10109081":{n:"容县"},"c10109087":{n:"陆川"},"c10109053":{n:"博白"},"c10109105":{n:"兴业"},"c10109048":{n:"北流"}},"c10109004":{n:"百色","c10109106":{n:"市辖区"},"c10109035":{n:"田阳"},"c10109041":{n:"田东"},"c10109046":{n:"平果"},"c10109085":{n:"德保"},"c10109073":{n:"靖西"},"c10109051":{n:"那坡"},"c10109069":{n:"凌云"},"c10109079":{n:"乐业"},"c10109024":{n:"田林"},"c10109029":{n:"西林"},"c10109064":{n:"隆林"}},"c10109089":{n:"贺州","c10109107":{n:"市辖区"},"c10109066":{n:"昭平"},"c10109037":{n:"钟山"},"c10109075":{n:"富川"}},"c10109009":{n:"河池","c10109108":{n:"市辖区"},"c10109038":{n:"南丹"},"c10109067":{n:"天峨"},"c10109032":{n:"凤山"},"c10109071":{n:"东兰"},"c10109063":{n:"罗城"},"c10109027":{n:"环江"},"c10109076":{n:"巴马"},"c10109043":{n:"都安"},"c10109082":{n:"大化"},"c10109022":{n:"宜州"}},"c10109018":{n:"来宾","c10109109":{n:"市辖区"},"c10109057":{n:"忻城"},"c10109023":{n:"象州"},"c10109060":{n:"武宣"},"c10109052":{n:"金秀"},"c10109013":{n:"合山"}},"c10109083":{n:"崇左","c10109110":{n:"市辖区"},"c10109030":{n:"扶绥"},"c10109049":{n:"宁明"},"c10109015":{n:"龙州"},"c10109020":{n:"大新"},"c10109061":{n:"天等"},"c10109077":{n:"凭祥"}}},"c10111000":{n:"海南","c10111001":{n:"海口","c10111023":{n:"秀英区"},"c10111024":{n:"龙华区"},"c10111008":{n:"琼山区"},"c10111025":{n:"美兰区"}},"c10111002":{n:"三亚","c10111026":{n:"市辖区"}},"c10111022":{n:"省直辖县级","c10111021":{n:"五指山"},"c10111007":{n:"琼海"},"c10111020":{n:"儋州"},"c10111006":{n:"文昌"},"c10111017":{n:"万宁"},"c10111013":{n:"东方"},"c10111014":{n:"定安"},"c10111016":{n:"屯昌"},"c10111004":{n:"澄迈"},"c10111015":{n:"临高"},"c10111012":{n:"白沙"},"c10111005":{n:"昌江"},"c10111018":{n:"乐东"},"c10111019":{n:"陵水"},"c10111010":{n:"保亭"},"c10111011":{n:"琼中"},"c10111027":{n:"西沙群岛"},"c10111028":{n:"南沙群岛"},"c10111029":{n:"中沙群岛的岛礁及其海域"}}},"c10110000":{n:"贵州","c10110001":{n:"贵阳","c10110085":{n:"南明区"},"c10110086":{n:"云岩区"},"c10110087":{n:"花溪区"},"c10110088":{n:"乌当区"},"c10110089":{n:"白云区"},"c10110090":{n:"小河区"},"c10110052":{n:"开阳"},"c10110015":{n:"息烽"},"c10110048":{n:"修文"},"c10110009":{n:"清镇"}},"c10110002":{n:"六盘水","c10110091":{n:"钟山区"},"c10110034":{n:"六枝特区"},"c10110092":{n:"水城"},"c10110073":{n:"盘县"}},"c10110007":{n:"遵义","c10110093":{n:"市辖区"},"c10110094":{n:"遵义县"},"c10110066":{n:"桐梓"},"c10110032":{n:"绥阳"},"c10110071":{n:"正安"},"c10110036":{n:"道真"},"c10110013":{n:"务川"},"c10110041":{n:"凤冈"},"c10110076":{n:"湄潭"},"c10110046":{n:"余庆"},"c10110023":{n:"习水"},"c10110057":{n:"赤水"},"c10110061":{n:"仁怀"}},"c10110006":{n:"安顺","c10110095":{n:"市辖区"},"c10110044":{n:"平坝"},"c10110053":{n:"普定"},"c10110016":{n:"镇宁"},"c10110049":{n:"关岭"},"c10110010":{n:"紫云"}},"c10110021":{n:"毕节","c10110096":{n:"市辖区"},"c10110025":{n:"大方"},"c10110059":{n:"黔西"},"c10110063":{n:"金沙"},"c10110029":{n:"织金"},"c10110020":{n:"纳雍"},"c10110017":{n:"威宁"},"c10110054":{n:"赫章"}},"c10110055":{n:"铜仁","c10110097":{n:"市辖区"},"c10110075":{n:"江口"},"c10110003":{n:"玉屏"},"c10110040":{n:"石阡"},"c10110080":{n:"思南"},"c10110045":{n:"印江"},"c10110011":{n:"德江"},"c10110065":{n:"沿河"},"c10110031":{n:"松桃"}},"c10110082":{n:"黔西南","c10110026":{n:"兴义"},"c10110035":{n:"兴仁"},"c10110039":{n:"普安"},"c10110079":{n:"晴隆"},"c10110074":{n:"贞丰"},"c10110030":{n:"望谟"},"c10110064":{n:"册亨"},"c10110069":{n:"安龙"}},"c10110083":{n:"黔东南","c10110004":{n:"凯里"},"c10110014":{n:"黄平"},"c10110047":{n:"施秉"},"c10110018":{n:"三穗"},"c10110012":{n:"镇远"},"c10110051":{n:"岑巩"},"c10110056":{n:"天柱"},"c10110022":{n:"锦屏"},"c10110068":{n:"剑河"},"c10110008":{n:"台江"},"c10110060":{n:"黎平"},"c10110042":{n:"榕江"},"c10110027":{n:"从江"},"c10110038":{n:"雷山"},"c10110043":{n:"麻江"},"c10110078":{n:"丹寨"}},"c10110084":{n:"黔南","c10110005":{n:"都匀"},"c10110058":{n:"福泉"},"c10110028":{n:"荔波"},"c10110019":{n:"贵定"},"c10110024":{n:"瓮安"},"c10110067":{n:"独山"},"c10110033":{n:"平塘"},"c10110072":{n:"罗甸"},"c10110050":{n:"长顺"},"c10110077":{n:"龙里"},"c10110037":{n:"惠水"},"c10110062":{n:"三都"}}},"c10130000":{n:"云南","c10130001":{n:"昆明","c10130131":{n:"五华区"},"c10130132":{n:"盘龙区"},"c10130133":{n:"官渡区"},"c10130134":{n:"西山区"},"c10130026":{n:"东川区"},"c10130024":{n:"呈贡区"},"c10130087":{n:"晋宁"},"c10130072":{n:"富民"},"c10130079":{n:"宜良"},"c10130135":{n:"石林"},"c10130017":{n:"嵩明"},"c10130039":{n:"禄劝"},"c10130080":{n:"寻甸"},"c10130031":{n:"安宁"}},"c10130002":{n:"曲靖","c10130136":{n:"市辖区"},"c10130025":{n:"马龙"},"c10130095":{n:"陆良"},"c10130032":{n:"师宗"},"c10130047":{n:"罗平"},"c10130040":{n:"富源"},"c10130088":{n:"会泽"},"c10130137":{n:"沾益"},"c10130101":{n:"宣威"}},"c10130011":{n:"玉溪","c10130138":{n:"市辖区"},"c10130105":{n:"江川"},"c10130067":{n:"澄江"},"c10130059":{n:"通海"},"c10130043":{n:"华宁"},"c10130119":{n:"易门"},"c10130126":{n:"峨山"},"c10130051":{n:"新平"},"c10130111":{n:"元江"}},"c10130010":{n:"保山","c10130139":{n:"市辖区"},"c10130123":{n:"施甸"},"c10130055":{n:"腾冲"},"c10130063":{n:"龙陵"},"c10130115":{n:"昌宁"}},"c10130003":{n:"昭通","c10130140":{n:"市辖区"},"c10130117":{n:"鲁甸"},"c10130109":{n:"巧家"},"c10130049":{n:"盐津"},"c10130042":{n:"大关"},"c10130034":{n:"永善"},"c10130057":{n:"绥江"},"c10130089":{n:"镇雄"},"c10130097":{n:"彝良"},"c10130103":{n:"威信"},"c10130065":{n:"水富"}},"c10130030":{n:"丽江","c10130141":{n:"市辖区"},"c10130142":{n:"玉龙"},"c10130100":{n:"永胜"},"c10130038":{n:"华坪"},"c10130093":{n:"宁蒗"}},"c10130052":{n:"普洱","c10130143":{n:"市辖区"},"c10130144":{n:"宁洱"},"c10130112":{n:"墨江"},"c10130120":{n:"景东"},"c10130060":{n:"景谷"},"c10130019":{n:"镇沅"},"c10130074":{n:"江城"},"c10130082":{n:"孟连"},"c10130068":{n:"澜沧"},"c10130012":{n:"西盟"}},"c10130009":{n:"临沧","c10130145":{n:"市辖区"},"c10130048":{n:"凤庆"},"c10130108":{n:"云县"},"c10130102":{n:"永德"},"c10130096":{n:"镇康"},"c10130056":{n:"双江"},"c10130033":{n:"耿马"},"c10130041":{n:"沧源"}},"c10130008":{n:"楚雄","c10130146":{n:"楚雄市"},"c10130099":{n:"双柏"},"c10130081":{n:"牟定"},"c10130029":{n:"南华"},"c10130092":{n:"姚安"},"c10130022":{n:"大姚"},"c10130085":{n:"永仁"},"c10130037":{n:"元谋"},"c10130044":{n:"武定"},"c10130018":{n:"禄丰"}},"c10130098":{n:"红河州","c10130027":{n:"个旧"},"c10130004":{n:"开远"},"c10130104":{n:"蒙自"},"c10130073":{n:"屏边"},"c10130050":{n:"建水"},"c10130090":{n:"石屏"},"c10130035":{n:"弥勒"},"c10130058":{n:"泸西"},"c10130125":{n:"元阳"},"c10130153":{n:"红河"},"c10130118":{n:"金平"},"c10130066":{n:"绿春"},"c10130110":{n:"河口"}},"c10130005":{n:"文山","c10130147":{n:"文山市"},"c10130015":{n:"砚山"},"c10130091":{n:"西畴"},"c10130036":{n:"麻栗坡"},"c10130084":{n:"马关"},"c10130077":{n:"丘北"},"c10130021":{n:"广南"},"c10130028":{n:"富宁"}},"c10130127":{n:"西双版纳","c10130045":{n:"景洪"},"c10130148":{n:"勐海"},"c10130149":{n:"勐腊"}},"c10130007":{n:"大理","c10130150":{n:"大理市"},"c10130083":{n:"漾濞"},"c10130054":{n:"祥云"},"c10130062":{n:"宾川"},"c10130070":{n:"弥渡"},"c10130114":{n:"南涧"},"c10130020":{n:"巍山"},"c10130076":{n:"永平"},"c10130122":{n:"云龙"},"c10130014":{n:"洱源"},"c10130107":{n:"剑川"},"c10130046":{n:"鹤庆"}},"c10130128":{n:"德宏","c10130121":{n:"瑞丽"},"c10130151":{n:"芒市"},"c10130075":{n:"梁河"},"c10130013":{n:"盈江"},"c10130069":{n:"陇川"}},"c10130129":{n:"怒江","c10130064":{n:"泸水"},"c10130124":{n:"福贡"},"c10130071":{n:"贡山"},"c10130016":{n:"兰坪"}},"c10130130":{n:"迪庆","c10130152":{n:"香格里拉"},"c10130086":{n:"德钦"},"c10130023":{n:"维西"}}},"c10128000":{n:"西藏","c10128001":{n:"拉萨","c10128025":{n:"城关区"},"c10128026":{n:"林周"},"c10128027":{n:"当雄"},"c10128015":{n:"尼木"},"c10128022":{n:"曲水"},"c10128013":{n:"堆龙德庆"},"c10128028":{n:"达孜"},"c10128029":{n:"墨竹工卡"}},"c10128003":{n:"昌都","c10128030":{n:"昌都县"},"c10128017":{n:"江达"},"c10128031":{n:"贡觉"},"c10128032":{n:"类乌齐"},"c10128019":{n:"丁青"},"c10128033":{n:"察雅"},"c10128018":{n:"八宿"},"c10128034":{n:"左贡"},"c10128009":{n:"芒康"},"c10128010":{n:"洛隆"},"c10128035":{n:"边坝"}},"c10128004":{n:"山南","c10128036":{n:"乃东"},"c10128016":{n:"扎囊"},"c10128008":{n:"贡嘎"},"c10128037":{n:"桑日"},"c10128038":{n:"琼结"},"c10128039":{n:"曲松"},"c10128040":{n:"措美"},"c10128041":{n:"洛扎"},"c10128042":{n:"加查"},"c10128043":{n:"隆子"},"c10128044":{n:"错那"},"c10128045":{n:"浪卡子"}},"c10128005":{n:"日喀则","c10128046":{n:"日喀则市"},"c10128047":{n:"南木林"},"c10128048":{n:"江孜"},"c10128049":{n:"定日"},"c10128050":{n:"萨迦"},"c10128051":{n:"拉孜"},"c10128052":{n:"昂仁"},"c10128053":{n:"谢通门"},"c10128054":{n:"白朗"},"c10128024":{n:"仁布"},"c10128055":{n:"康马"},"c10128056":{n:"定结"},"c10128057":{n:"仲巴"},"c10128058":{n:"亚东"},"c10128059":{n:"吉隆"},"c10128060":{n:"聂拉木"},"c10128061":{n:"萨嘎"},"c10128062":{n:"岗巴"}},"c10128002":{n:"那曲","c10128063":{n:"那曲县"},"c10128064":{n:"嘉黎"},"c10128020":{n:"比如"},"c10128065":{n:"聂荣"},"c10128066":{n:"安多"},"c10128067":{n:"申扎"},"c10128014":{n:"索县"},"c10128021":{n:"班戈"},"c10128011":{n:"巴青"},"c10128023":{n:"尼玛"}},"c10128006":{n:"阿里","c10128068":{n:"普兰"},"c10128069":{n:"札达"},"c10128070":{n:"噶尔"},"c10128071":{n:"日土"},"c10128072":{n:"革吉"},"c10128073":{n:"改则"},"c10128012":{n:"措勤"}},"c10128007":{n:"林芝","c10128074":{n:"林芝县"},"c10128080":{n:"工布江达"},"c10128075":{n:"米林"},"c10128076":{n:"墨脱"},"c10128077":{n:"波密"},"c10128078":{n:"察隅"},"c10128079":{n:"朗县"}}},"c10126000":{n:"陕西","c10126001":{n:"西安","c10126099":{n:"新城区"},"c10126100":{n:"碑林区"},"c10126101":{n:"莲湖区"},"c10126102":{n:"灞桥区"},"c10126103":{n:"未央区"},"c10126104":{n:"雁塔区"},"c10126105":{n:"阎良区"},"c10126072":{n:"临潼区"},"c10126027":{n:"长安区"},"c10126033":{n:"蓝田"},"c10126078":{n:"周至"},"c10126038":{n:"户县"},"c10126083":{n:"高陵"}},"c10126010":{n:"铜川","c10126106":{n:"市辖区"},"c10126016":{n:"宜君"}},"c10126006":{n:"宝鸡","c10126107":{n:"市辖区"},"c10126090":{n:"凤翔"},"c10126042":{n:"岐山"},"c10126084":{n:"扶风"},"c10126039":{n:"眉县"},"c10126034":{n:"陇县"},"c10126073":{n:"千阳"},"c10126068":{n:"麟游"},"c10126079":{n:"凤县"},"c10126028":{n:"太白"}},"c10126011":{n:"咸阳","c10126108":{n:"市辖区"},"c10126091":{n:"三原"},"c10126043":{n:"泾阳"},"c10126040":{n:"乾县"},"c10126085":{n:"礼泉"},"c10126015":{n:"永寿"},"c10126080":{n:"彬县"},"c10126061":{n:"长武"},"c10126095":{n:"旬邑"},"c10126048":{n:"淳化"},"c10126022":{n:"武功"},"c10126054":{n:"兴平"}},"c10126002":{n:"渭南","c10126109":{n:"市辖区"},"c10126037":{n:"华县"},"c10126071":{n:"潼关"},"c10126077":{n:"大荔"},"c10126060":{n:"合阳"},"c10126017":{n:"澄城"},"c10126021":{n:"蒲城"},"c10126063":{n:"白水"},"c10126026":{n:"富平"},"c10126067":{n:"韩城"},"c10126032":{n:"华阴"}},"c10126003":{n:"延安","c10126110":{n:"市辖区"},"c10126023":{n:"延长"},"c10126029":{n:"延川"},"c10126069":{n:"子长"},"c10126046":{n:"安塞"},"c10126051":{n:"志丹"},"c10126111":{n:"吴起"},"c10126093":{n:"甘泉"},"c10126088":{n:"富县"},"c10126012":{n:"洛川"},"c10126057":{n:"宜川"},"c10126018":{n:"黄龙"},"c10126074":{n:"黄陵"}},"c10126008":{n:"汉中","c10126112":{n:"市辖区"},"c10126025":{n:"南郑"},"c10126066":{n:"城固"},"c10126020":{n:"洋县"},"c10126059":{n:"西乡"},"c10126053":{n:"勉县"},"c10126094":{n:"宁强"},"c10126047":{n:"略阳"},"c10126014":{n:"镇巴"},"c10126013":{n:"留坝"},"c10126052":{n:"佛坪"}},"c10126005":{n:"榆林","c10126113":{n:"市辖区"},"c10126075":{n:"神木"},"c10126092":{n:"府谷"},"c10126044":{n:"横山"},"c10126035":{n:"靖边"},"c10126081":{n:"定边"},"c10126004":{n:"绥德"},"c10126086":{n:"米脂"},"c10126049":{n:"佳县"},"c10126055":{n:"吴堡"},"c10126030":{n:"清涧"},"c10126096":{n:"子洲"}},"c10126007":{n:"安康","c10126114":{n:"市辖区"},"c10126041":{n:"汉阴"},"c10126036":{n:"石泉"},"c10126087":{n:"宁陕"},"c10126031":{n:"紫阳"},"c10126045":{n:"岚皋"},"c10126076":{n:"平利"},"c10126019":{n:"镇坪"},"c10126082":{n:"旬阳"},"c10126058":{n:"白河"}},"c10126098":{n:"商洛","c10126115":{n:"市辖区"},"c10126050":{n:"洛南"},"c10126097":{n:"丹凤"},"c10126089":{n:"商南"},"c10126065":{n:"山阳"},"c10126024":{n:"镇安"},"c10126070":{n:"柞水"}}},"c10108000":{n:"甘肃","c10108001":{n:"兰州","c10108086":{n:"城关区"},"c10108087":{n:"七里河区"},"c10108088":{n:"西固区"},"c10108089":{n:"安宁区"},"c10108028":{n:"红古区"},"c10108069":{n:"永登"},"c10108065":{n:"皋兰"},"c10108032":{n:"榆中"}},"c10108023":{n:"嘉峪关","c10108090":{n:"市辖区"}},"c10108006":{n:"金昌","c10108091":{n:"市辖区"},"c10108030":{n:"永昌"}},"c10108078":{n:"白银","c10108092":{n:"市辖区"},"c10108044":{n:"靖远"},"c10108014":{n:"会宁"},"c10108049":{n:"景泰"}},"c10108007":{n:"天水","c10108093":{n:"市辖区"},"c10108075":{n:"清水"},"c10108070":{n:"秦安"},"c10108066":{n:"甘谷"},"c10108033":{n:"武山"},"c10108036":{n:"张家川"}},"c10108003":{n:"武威","c10108094":{n:"市辖区"},"c10108020":{n:"民勤"},"c10108026":{n:"古浪"},"c10108059":{n:"天祝"}},"c10108002":{n:"张掖","c10108095":{n:"市辖区"},"c10108096":{n:"肃南"},"c10108038":{n:"民乐"},"c10108077":{n:"临泽"},"c10108072":{n:"高台"},"c10108034":{n:"山丹"}},"c10108009":{n:"平凉","c10108097":{n:"市辖区"},"c10108041":{n:"泾川"},"c10108080":{n:"灵台"},"c10108046":{n:"崇信"},"c10108083":{n:"华亭"},"c10108051":{n:"庄浪"},"c10108074":{n:"静宁"}},"c10108004":{n:"酒泉","c10108098":{n:"市辖区"},"c10108017":{n:"金塔"},"c10108099":{n:"瓜州"},"c10108061":{n:"肃北"},"c10108056":{n:"阿克塞"},"c10108048":{n:"玉门"},"c10108052":{n:"敦煌"}},"c10108064":{n:"庆阳","c10108100":{n:"市辖区"},"c10108101":{n:"庆城"},"c10108035":{n:"环县"},"c10108079":{n:"华池"},"c10108073":{n:"合水"},"c10108040":{n:"正宁"},"c10108031":{n:"宁县"},"c10108068":{n:"镇原"}},"c10108008":{n:"定西","c10108102":{n:"市辖区"},"c10108055":{n:"通渭"},"c10108011":{n:"陇西"},"c10108027":{n:"渭源"},"c10108060":{n:"临洮"},"c10108016":{n:"漳县"},"c10108021":{n:"岷县"}},"c10108084":{n:"陇南","c10108103":{n:"市辖区"},"c10108045":{n:"成县"},"c10108050":{n:"文县"},"c10108015":{n:"宕昌"},"c10108082":{n:"康县"},"c10108054":{n:"西和"},"c10108019":{n:"礼县"},"c10108058":{n:"徽县"},"c10108025":{n:"两当"}},"c10108085":{n:"临夏","c10108022":{n:"临夏市"},"c10108053":{n:"临夏县"},"c10108062":{n:"康乐"},"c10108018":{n:"永靖"},"c10108029":{n:"广河"},"c10108057":{n:"和政"},"c10108024":{n:"东乡族自治县"},"c10108067":{n:"积石山"}},"c10108012":{n:"甘南","c10108104":{n:"合作"},"c10108037":{n:"临潭"},"c10108105":{n:"卓尼"},"c10108076":{n:"舟曲"},"c10108013":{n:"迭部"},"c10108081":{n:"玛曲"},"c10108042":{n:"碌曲"},"c10108071":{n:"夏河"}}},"c10123000":{n:"青海","c10123001":{n:"西宁","c10123049":{n:"城东区"},"c10123050":{n:"城中区"},"c10123051":{n:"城西区"},"c10123052":{n:"城北区"},"c10123027":{n:"大通"},"c10123030":{n:"湟中"},"c10123033":{n:"湟源"}},"c10123045":{n:"海东","c10123053":{n:"平安"},"c10123017":{n:"民和"},"c10123008":{n:"乐都"},"c10123014":{n:"互助"},"c10123020":{n:"化隆"},"c10123036":{n:"循化"}},"c10123046":{n:"海北","c10123012":{n:"门源"},"c10123028":{n:"祁连"},"c10123025":{n:"海晏"},"c10123009":{n:"刚察"}},"c10123047":{n:"黄南","c10123039":{n:"同仁"},"c10123007":{n:"尖扎"},"c10123029":{n:"泽库"},"c10123026":{n:"河南"}},"c10123048":{n:"海南","c10123023":{n:"共和"},"c10123006":{n:"同德"},"c10123024":{n:"贵德"},"c10123013":{n:"兴海"},"c10123044":{n:"贵南"}},"c10123002":{n:"果洛","c10123041":{n:"玛沁"},"c10123037":{n:"班玛"},"c10123021":{n:"甘德"},"c10123034":{n:"达日"},"c10123054":{n:"久治"},"c10123018":{n:"玛多"}},"c10123003":{n:"玉树","c10123055":{n:"玉树县"},"c10123022":{n:"杂多"},"c10123019":{n:"称多"},"c10123035":{n:"治多"},"c10123038":{n:"囊谦"},"c10123040":{n:"曲麻莱"}},"c10123005":{n:"海西","c10123004":{n:"格尔木"},"c10123043":{n:"德令哈"},"c10123010":{n:"乌兰"},"c10123032":{n:"都兰"},"c10123016":{n:"天峻"}}},"c10122000":{n:"宁夏","c10122001":{n:"银川","c10122022":{n:"兴庆区"},"c10122023":{n:"西夏区"},"c10122024":{n:"金凤区"},"c10122016":{n:"永宁"},"c10122009":{n:"贺兰"},"c10122012":{n:"灵武"}},"c10122002":{n:"石嘴山","c10122025":{n:"市辖区"},"c10122004":{n:"平罗"}},"c10122010":{n:"吴忠","c10122026":{n:"市辖区"},"c10122013":{n:"盐池"},"c10122018":{n:"同心"},"c10122007":{n:"青铜峡"}},"c10122003":{n:"固原","c10122027":{n:"市辖区"},"c10122008":{n:"西吉"},"c10122015":{n:"隆德"},"c10122019":{n:"泾源"},"c10122017":{n:"彭阳"}},"c10122011":{n:"中卫","c10122028":{n:"市辖区"},"c10122006":{n:"中宁"},"c10122021":{n:"海原"}}},"c10129000":{n:"新疆","c10129001":{n:"乌鲁木齐","c10129092":{n:"天山区"},"c10129093":{n:"沙依巴克区"},"c10129094":{n:"新市区"},"c10129095":{n:"水磨沟区"},"c10129096":{n:"头屯河区"},"c10129097":{n:"达坂城区"},"c10129098":{n:"米东区"},"c10129099":{n:"乌鲁木齐县"}},"c10129004":{n:"克拉玛依","c10129100":{n:"市辖区"}},"c10129009":{n:"吐鲁番","c10129101":{n:"吐鲁番市"},"c10129075":{n:"鄯善"},"c10129040":{n:"托克逊"}},"c10129008":{n:"哈密","c10129102":{n:"哈密市"},"c10129103":{n:"巴里坤"},"c10129026":{n:"伊吾"}},"c10129017":{n:"昌吉","c10129104":{n:"昌吉市"},"c10129032":{n:"阜康"},"c10129062":{n:"呼图壁"},"c10129027":{n:"玛纳斯"},"c10129056":{n:"奇台"},"c10129065":{n:"吉木萨尔"},"c10129070":{n:"木垒"}},"c10129089":{n:"博尔塔拉","c10129067":{n:"博乐"},"c10129034":{n:"精河"},"c10129072":{n:"温泉"}},"c10129007":{n:"巴音郭楞","c10129080":{n:"库尔勒"},"c10129047":{n:"轮台"},"c10129059":{n:"尉犁"},"c10129020":{n:"若羌"},"c10129025":{n:"且末"},"c10129043":{n:"焉耆"},"c10129014":{n:"和静"},"c10129053":{n:"和硕"},"c10129084":{n:"博湖"}},"c10129010":{n:"阿克苏","c10129105":{n:"阿克苏市"},"c10129038":{n:"温宿"},"c10129030":{n:"库车"},"c10129035":{n:"沙雅"},"c10129068":{n:"新和"},"c10129073":{n:"拜城"},"c10129078":{n:"乌什"},"c10129082":{n:"阿瓦提"},"c10129045":{n:"柯坪"}},"c10129088":{n:"克孜勒苏","c10129024":{n:"阿图什"},"c10129029":{n:"阿克陶"},"c10129087":{n:"阿合奇"},"c10129064":{n:"乌恰"}},"c10129011":{n:"喀什","c10129106":{n:"喀什市"},"c10129018":{n:"疏附"},"c10129041":{n:"疏勒"},"c10129037":{n:"英吉沙"},"c10129066":{n:"泽普"},"c10129033":{n:"莎车"},"c10129028":{n:"叶城"},"c10129063":{n:"麦盖提"},"c10129071":{n:"岳普湖"},"c10129057":{n:"伽师"},"c10129023":{n:"巴楚"},"c10129076":{n:"塔什库尔干"}},"c10129012":{n:"和田","c10129107":{n:"和田市"},"c10129108":{n:"和田县"},"c10129069":{n:"墨玉"},"c10129031":{n:"皮山"},"c10129036":{n:"洛浦"},"c10129074":{n:"策勒"},"c10129039":{n:"于田"},"c10129079":{n:"民丰"}},"c10129090":{n:"伊犁","c10129005":{n:"伊宁市"},"c10129081":{n:"奎屯"},"c10129114":{n:"伊宁县"},"c10129044":{n:"察布查尔锡伯"},"c10129085":{n:"霍城"},"c10129015":{n:"巩留"},"c10129048":{n:"新源"},"c10129060":{n:"昭苏"},"c10129021":{n:"特克斯"},"c10129054":{n:"尼勒克"}},"c10129086":{n:"塔城","c10129109":{n:"塔城市"},"c10129003":{n:"乌苏"},"c10129049":{n:"额敏"},"c10129050":{n:"沙湾"},"c10129055":{n:"托里"},"c10129016":{n:"裕民"},"c10129077":{n:"和布克赛尔"}},"c10129006":{n:"阿勒泰","c10129110":{n:"阿勒泰市"},"c10129111":{n:"布尔津"},"c10129052":{n:"富蕴"},"c10129019":{n:"福海"},"c10129013":{n:"哈巴河"},"c10129083":{n:"青河"},"c10129058":{n:"吉木乃"}},"c10129091":{n:"自治区直辖县级","c10129002":{n:"石河子"},"c10129042":{n:"阿拉尔"},"c10129112":{n:"图木舒克"},"c10129113":{n:"五家渠"}}},"c10132000":{n:"澳门",d:1,"c10132001":{n:"澳门"}},"c10133000":{n:"香港","c10133001":{n:"香港岛","c10133004":{n:"中西区"},"c10133010":{n:"湾仔区"},"c10133005":{n:"东区"},"c10133007":{n:"南区"}},"c10133002":{n:"九龙","c10133011":{n:"油尖旺区"},"c10133008":{n:"深水埗区"},"c10133022":{n:"九龙城区"},"c10133009":{n:"黄大仙区"},"c10133006":{n:"观塘区"}},"c10133003":{n:"新界","c10133014":{n:"北区"},"c10133018":{n:"大埔区"},"c10133016":{n:"沙田区"},"c10133015":{n:"西贡区"},"c10133019":{n:"荃湾区"},"c10133017":{n:"屯门区"},"c10133020":{n:"元朗区"},"c10133013":{n:"葵青区"},"c10133012":{n:"离岛区"}}},"c10134000":{n:"台湾",d:1,"c10134030":{n:"台北"},"c10134013":{n:"新北"},"c10134031":{n:"高雄"},"c10134032":{n:"桃园"},"c10134033":{n:"新竹"},"c10134034":{n:"宜兰"},"c10134035":{n:"苗栗"},"c10134036":{n:"屏东"},"c10134037":{n:"花莲"},"c10134038":{n:"彰化"},"c10134039":{n:"南投"},"c10134004":{n:"云林"},"c10134040":{n:"台东"},"c10134041":{n:"基隆"},"c10134042":{n:"台中"},"c10134043":{n:"台南"},"c10134044":{n:"嘉义"},"c10134045":{n:"澎湖"}},"c10200000":{n:"国外",d:1,"c10500000":{n:"美国"},"c10600000":{n:"加拿大"},"c14300000":{n:"墨西哥"},"c14100000":{n:"巴西"},"c14000000":{n:"阿根廷"},"c14200000":{n:"智利"},"c14400000":{n:"秘鲁"},"c15000000":{n:"哥伦比亚"},"c15100000":{n:"委内瑞拉"},"c10900000":{n:"英国"},"c11000000":{n:"法国"},"c11100000":{n:"德国"},"c13000000":{n:"土耳其"},"c13100000":{n:"乌克兰"},"c13200000":{n:"意大利"},"c13300000":{n:"芬兰"},"c13400000":{n:"荷兰"},"c13500000":{n:"挪威"},"c13600000":{n:"葡萄牙"},"c13700000":{n:"西班牙"},"c13800000":{n:"瑞典"},"c13900000":{n:"瑞士"},"c14500000":{n:"奥地利"},"c14600000":{n:"比利时"},"c14700000":{n:"丹麦"},"c14800000":{n:"希腊"},"c14900000":{n:"匈牙利"},"c15200000":{n:"爱尔兰"},"c15300000":{n:"保加利亚"},"c15400000":{n:"冰岛"},"c15500000":{n:"卢森堡"},"c15600000":{n:"罗马尼亚"},"c11200000":{n:"俄罗斯"},"c10800000":{n:"澳大利亚"},"c11300000":{n:"新西兰"},"c10700000":{n:"日本"},"c11900000":{n:"韩国"},"c12700000":{n:"朝鲜"},"c11400000":{n:"泰国"},"c11500000":{n:"马来西亚"},"c11600000":{n:"印度尼西亚"},"c11700000":{n:"菲律宾"},"c11800000":{n:"新加坡"},"c12000000":{n:"缅甸"},"c12100000":{n:"越南"},"c12200000":{n:"柬埔寨"},"c12300000":{n:"老挝"},"c12400000":{n:"印度"},"c12500000":{n:"文莱"},"c12600000":{n:"巴基斯坦"},"c12800000":{n:"尼泊尔"},"c12900000":{n:"斯里兰卡"},"c15700000":{n:"以色列"},"c15800000":{n:"埃及"},"c15900000":{n:"南非"},"c16000000":{n:"奥克兰"},"c16100000":{n:"喀麦隆"},"c16200000":{n:"毛里求斯"},"c16300000":{n:"马达加斯加"},"c16400000":{n:"其它地区"}}
    };
    syscode.districtMap={};
    syscode.getDistrictText=function(value){
		if(!value){return}
		value=value+"";
	    var cprefix=value.substring(0,1);
		if("c"!=cprefix){
		   value="c"+value;
		}
        var text=this.districtMap[value];
        return text?text:'';
    };

    syscode.initWorkCityText=function(id,cityid,defaultValue,title,cityHandler,cityLevel){
	  //设置省值
	   var mainId=$("#"+id);
       var mainHideShow=$("#jsProvinceList"+id+"_hideShow");
	   var defaultTitle='';
       if(title){
           defaultTitle=title.split(',')[1];
       }
	   var proValue=defaultValue;
        if(proValue>1){
            proValue=proValue.substring(0,5)+'000';
        }
        if(''!=defaultValue&&'-1'!=defaultValue&&'10100000'!=defaultValue){
			if(parseInt(proValue)>10200000){
				proValue="10200000";
				mainId.val('10200000');
				mainHideShow.val('国外');
			}else{
				mainId.val(proValue);
				mainHideShow.val(syscode.getDistrictText(proValue));
			}
        }else{
			mainId.val(defaultValue);
			mainHideShow.val(defaultTitle);
        }
		//设置城市
        syscode.cityChildText(cityid,proValue,title,cityHandler,cityLevel);
		syscode.setCityText(cityid,defaultValue,title);
	};
	
	var $win=$(window);
	syscode.calcPos=function(input,showDiv){
	   var $input=$(input);
	   var offset=$input.offset();
	   var offsetTop=offset.top;
	   var offsetLeft=offset.left;
	   var vleft=true;
	   var vtop=false;
	   var windowScrollTop=$win.scrollTop();
	   var showDivOuterWidth=showDiv.outerWidth();
	   var showDivOuterHeight=showDiv.outerHeight();
	   var inputOuterWidth=$input.outerWidth();
	   var inputOffsetHeight=input.offsetHeight;
	   if($win.width() < (offsetLeft + showDivOuterWidth)){
		   vleft = false;
	   }
	   if((offsetTop - windowScrollTop + showDivOuterHeight + inputOffsetHeight) > $win.height()){
		   vtop = true;
	   }
	   if((showDivOuterHeight - offsetTop - windowScrollTop) > 0){
		   vtop=false;
	   }
	   if(vleft){
		   if(vtop){
			   showDiv.css({left:offsetLeft,top:offsetTop - showDivOuterHeight});
		   }else{
			   showDiv.css({left:offsetLeft,top:offsetTop + inputOffsetHeight});
		   }
	   }else{
		   if(vtop){
			   showDiv.css({left:(offsetLeft + inputOuterWidth - showDivOuterWidth),top:(offsetTop - showDivOuterHeight)});
		   }else{
			   showDiv.css({left:(offsetLeft + inputOuterWidth - showDivOuterWidth),top:(offsetTop + inputOffsetHeight)});
		   }
	   }
	   if(showDiv.html()){
		   showDiv.show();
	   }
   };
    /**
     *  省下拉选择
     * @param classStyle   输入框样式
     * @param id           值ID
     * @param name         值Name
     * @param cityid       城市ID
     * @param realValue    值
     * @param defaultValue 默认值
     * @param title        不限、请选择
     * @param label        前面label
     * @param handler      回调函数
     * @param cityHandler  城市回调函数
	 * @param cityLevel    城市级别 2  3(热点城市无子区县)
     */
    syscode.createProvinceText = function(classStyle, id, name, cityid, realValue, defaultValue, title,label,handler,cityHandler,cityLevel,filter){
		filter = filter || [];
        if(realValue&&''!=realValue){
            defaultValue=realValue;
        }
        var prefix='jsProvinceList';
        //主要部分
        var mainDiv='';
        if(label&&''!=label){
            mainDiv+='<label>'+label+'</label>';
        }
        mainDiv+='<input type="hidden" name="'+name+'" id="'+id+'" value="'+defaultValue+'">';
        mainDiv+='<input type="text" readonly="readonly" id="'+prefix+id+'_hideShow" value="'+syscode.getDistrictText(defaultValue)+'" class="'+classStyle+'">';
        document.write(mainDiv);
        var  mainDiv2='';
        mainDiv2+='<div class="area_box province_box" id="'+prefix+id+'" style="display: none;positoion:absolute;z-index:9999999;">';
		mainDiv2+='<div class="pleasechoosebox">请选择省/直辖市</div>';

        var hotcity=["10102000","10103000","10101002","10101201","10105000","10104000"];
        var hotcityOther=["10133000","10132000","10134000","10200000"];
        var mainDivHot=[];
		mainDivHot.push('<ul class="area_box_tr">');
        for(var i=0;i<hotcity.length;i++){
            var key= hotcity[i];
			var hasFilter = false;
			for(var j=0;j<filter.length;j++){if(key==filter[j])hasFilter = true;}
			if(hasFilter)
				continue;
			var otherkey="c"+key;
            mainDivHot.push('<li><a href="javascript:void(0)" v="'+key+'">'+syscode.getDistrictText(otherkey)+'</a></li>');
        }
        //中间部分
        
        //10132000,10133000,10134000,10200000
        var mainDivOther=[];
		mainDivOther.push('<ul class="area_box_tr2">');
        for(var i=0;i<hotcityOther.length;i++){
            var key= hotcityOther[i];
			var hasFilter = false;
			for(var j=0;j<filter.length;j++){if(key==filter[j])hasFilter = true;}
			if(hasFilter)
				continue;
			var otherkey="c"+key;
            mainDivOther.push('<li><a href="javascript:void(0)" v="'+key+'">'+syscode.district[otherkey].n+'</a></li>');
        }
		if('-1,不限'==title){
			mainDivOther.push('<li><a href="javascript:void(0)" v="-1">不限</a></li>');
		}
		var mainDivContent=[];
		mainDivContent.push('<ul class="area_box_tr">');
        //循环数据
        for(var pro in syscode.district){
			var readPro=pro.substring(1,pro.length);
            var tempHtml='<li><a href="javascript:void(0)" v="'+readPro+'">'+syscode.district[pro].n+'</a></li>';
            var hasHot=false;
			for(var j=0;j<filter.length;j++){if(readPro==filter[j])hasHot = true;}
			if(hasHot)
				continue;
            for(var i=0;i<hotcity.length;i++){if(("c"+hotcity[i])==pro){ hasHot=true;break;}}
            if(hasHot){continue;}
            for(var i=0;i<hotcityOther.length;i++){if(("c"+hotcityOther[i])==pro){ hasHot=true;break;}}
            if(hasHot){continue;}
            mainDivContent.push(tempHtml);
        }
        mainDivHot.push('</ul>');
        mainDivContent.push('</ul>');
        mainDivOther.push('</ul>');

        mainDiv2+=(mainDivHot.join("") + mainDivContent.join("") + mainDivOther.join("") + '</div>');
     $(function(){
        $(document.body).append(mainDiv2);
       var defaultTitle='';
       if(title){
           defaultTitle=title.split(',')[1];
       }
       var mainId=$(document.getElementById(id));
       var mainHideShow=$(document.getElementById(prefix+id+'_hideShow'));
       var mainForm=$(document.getElementById(prefix+id));

       var mainObj=document.getElementById(prefix+id+'_hideShow');
	   
       mainForm.find('a').click(function(){
           var $this=$(this);
           var value= $this.attr('v');
           mainId.val(value);
           mainHideShow.val(syscode.getDistrictText(value));
           mainForm.hide();
		   mainForm.find('.select').removeClass("select");
		   $this.addClass("select");
		   if(cityLevel==3){
			   var hotCity=false;
				for(var i=0;i<hotcity.length;i++){
					if(value==hotcity[i]){
					 hotCity=true;
					 break;
					}
				}
				if(hotCity){
					syscode.cityChildText(cityid,-1,title,cityHandler,cityLevel);
					syscode.setCityText(cityid,"-1",title);
					return false;
				}
		   }
           syscode.cityChildText(cityid,value,title,cityHandler,cityLevel);

           if("-1"==value||"10100000"==value){
               syscode.setCityText(cityid,"-1",title);
               mainId.val(value);
               mainHideShow.val(defaultTitle);
           }else if("10200000"==value){
               syscode.setCityText(cityid,"10500000","10500000,美国");
               $('#'+cityid+'_hideShow').focus();
               $('#'+cityid).val('10500000');
			   $('#jsCityListareaForm_'+cityid).find('a[v=10500000]').addClass("select");
           }else{
		      syscode.setCityText(cityid,"-1",title);
               $('#'+cityid+'_hideShow').focus();
               $('#'+cityid).val('-1');
			   $('#jsCityListareaForm_'+cityid).find('a[v=-1]').addClass("select");
		   }

		    //回调
           if(handler){
              handler.apply(null,[value]);
           }
           return false;
       });

        if ($.fn.bgiframe )
            mainForm.bgiframe();

        var proValue=defaultValue;
        if(proValue>1){
            proValue=proValue.substring(0,5)+'000'
        }
		syscode.cityChildText(cityid,proValue,title,cityHandler,cityLevel);
        if(''!=defaultValue&&'-1'!=defaultValue&&'10100000'!=defaultValue){
			if(parseInt(proValue)>10200000){
				proValue="10200000";
				mainId.val('10200000');
				mainHideShow.val('国外');
				mainForm.find('a[v="10200000"]').addClass("select");
			}else{
				mainId.val(proValue);
				mainHideShow.val(syscode.getDistrictText(proValue));
				mainForm.find('a[v='+proValue+']').addClass("select");
			}
			//为什么没起作用,这样就起作用了
			setTimeout(function(){
				if(defaultValue==proValue){
					$('#jsCityListareaForm_'+cityid).find('a[v=-1]').addClass("select");
				}else{
					$('#jsCityListareaForm_'+cityid).find('a[v='+defaultValue+']').addClass("select");
				}
			},200)
			
        }else{
			mainId.val(defaultValue);
			mainHideShow.val(defaultTitle);
			mainForm.find('a[v=-1]').addClass("select");
        }
		
        mainForm.mousedown(function() {
            mainForm.data('hasfocus',true);
        }).mouseup(function() {
             mainForm.data('hasfocus',false);
        }).click(function(){
			//mainHideShow.focus();
			return false;
		});
        mainHideShow.focus(function(){
			//$('#jsCityListareaForm_'+cityid).hide();
			syscode.calcPos(mainObj,mainForm);
        }).blur(function(){
            if(!mainForm.data('hasfocus')){
                mainForm.hide();
            }
        }).bind("click",function(){
			return false;
		});
         
        });
    };

    /**
     * 城市下拉
     * @param classStyle   样式
     * @param id           ID
     * @param name         Name
     * @param realValue    值
     * @param defaultValue 默认值
     * @param title        不限、或者请选择,例：-1,不限
     * @param label        里面label值
     * @param handler      回调函数
	 * @param cityLevel    城市级别
     */
    syscode.cityText= function(classStyle, id, name, realValue, defaultValue, title,label,handler,cityLevel) {
        if(realValue&&''!==realValue){
            defaultValue=realValue;
        }
        var prefix='jsCityListareaForm_';
        var tempHtml='';
        if(label&&''!=label){
            tempHtml+='<label>'+label+'</label>';
        }
        tempHtml+='<input type="hidden" name="'+name+'" id="'+id+'" value="'+defaultValue+'">';;
        tempHtml+='<input type="text" readonly="readonly"  id="'+id+'_hideShow" value="'+syscode.getDistrictText(defaultValue)+'" class="'+classStyle+'">';
        document.write(tempHtml);
        $(function(){
        var proValue=defaultValue;
        if(proValue>1){
            proValue=proValue.substring(0,5)+'000';
            syscode.cityChildText(id,proValue,title,handler,cityLevel);
        }

        var hideshowInput= $(document.getElementById(id+'_hideShow'));
        hideshowInput.focus(function(){
			var mainObj=document.getElementById(id+'_hideShow');
			var jsCity=$(document.getElementById(prefix+id));
			syscode.calcPos(mainObj,jsCity)
        }).blur(function(){
            var jsCity=$(document.getElementById(prefix+id));
            if(!jsCity.data('hasfocus')){
                jsCity.hide();
            }
        }).bind("click",function(){
			return false;
		});;
        var jscityObj= document.getElementById(id+'_hideShow');
        syscode.setCityText(id,realValue,title);
        });
    };

    /**
     * 设置城市值
     * @param id
     * @param realValue
     * @param title
     * @param defaultLevel
     */
    syscode.setCityText=function(id,realValue,title,defaultLevel){
        if(!id){
           return;
        }
        var defaultTitle='';
        if(title){
            defaultTitle=title.split(',')[1];
        }
		var prefixReadvalue="c"+realValue;
        $(document.getElementById(id)).val(realValue);
        if("-1"==realValue||"10100000"==realValue||(syscode.district[prefixReadvalue]&&!("10101002"==realValue||"10101201"==realValue))){
            $('#'+id+'_hideShow').val(defaultTitle).attr("title",defaultTitle);
            return;
        }
		
        var proValue=realValue;
        if(proValue>1){
            if(!defaultLevel){
                proValue=proValue.substring(0,5)+'000';
				if(parseInt(proValue)>10200000){
					proValue = "10200000";
				}
				if(proValue==realValue){
					$('#'+id+'_hideShow').val(defaultTitle).attr("title",defaultTitle);
					return;
				}
            }
        }else{
            $('#'+id+'_hideShow').val(defaultTitle).attr("title",defaultTitle);
            return;
        }
		var prefixproValue="c"+proValue;
		var prefixproWorkcitys = syscode.district[prefixproValue];
        if(!prefixproWorkcitys){
            var value= syscode.getDistrictText(realValue);
            $('#'+id+'_hideShow').val(value).attr("title",value);
            return;
        }
        //if(prefixproWorkcitys[prefixReadvalue]){
        if(prefixproWorkcitys[prefixReadvalue]){
			 /*var hasThirdlevel=false;
			 for(var p in syscode.district[prefixproValue][prefixReadvalue]){
                if("n"==p || "d" ==p){
                    continue;
                }
				if(hasThirdlevel){
					break;
				}
				hasThirdlevel=true;
			 }
			 if(defaultLevel){
				hasThirdlevel=false;
			 }
			 var value= syscode.getDistrictText(realValue);
			 if(hasThirdlevel){
				alert("aaa");
				$('#'+id+'_hideShow').val(value+' '+defaultTitle).attr("title",value+' '+defaultTitle);
			 }else{
				$('#'+id+'_hideShow').val(value).attr("title",value);
			 }*/
			var value= syscode.getDistrictText(realValue);
			$('#'+id+'_hideShow').val(value).attr("title",value);
        }else{
            var parentValue='';
            for(var p in prefixproWorkcitys){
                if("n"==p || "d" ==p){
                    continue;
                }
                for(var pp in prefixproWorkcitys[p]){
                    if(pp==prefixReadvalue){
                        parentValue=p;
                    }
                }
            }
			var value="";
			if(parentValue){
				value= syscode.getDistrictText(parentValue)+' '+syscode.getDistrictText(realValue);
			}else{
				value= syscode.getDistrictText(realValue);
			}           
            $('#'+id+'_hideShow').val(value).attr("title",value);
        }
    };

    syscode.cityChildText=function(id,realValue,title,cityHandler,cityLevel){
        if(!id){
            return;
        }
        $('#jsCityListareaForm_'+id).remove();
        var mainId=$('<div class="area_box w30" id="jsCityListareaForm_'+id+'" style="display: none;z-index:9999998;">').appendTo(document.body);
        var htmlTpl=[];
		htmlTpl.push('<div class="pleasechoosebox">请选择市/区/县</div>');
		htmlTpl.push('<div class="city_box">');
		if(parseInt(realValue)>10200000){
			realValue="10200000";
		}
		var prefixReadlValue="c"+realValue;
        //特殊10101002,10101201
        var pd=syscode.district[prefixReadlValue];
        var hotcity=false;
        var d='';
        if("10101201"==realValue||"10101002"==realValue){
            pd= syscode.district["c10101000"][prefixReadlValue];
            hotcity=true;
            d="-1";
        }
		if(cityLevel){
			 hotcity=true;
		}
		
        if(!pd){
            return;
        }
        if(!d){
            d=pd["d"];
        }
        if(d||cityLevel==2||cityLevel==3){
            htmlTpl.push('<div class="area_box_tr2">');
            if('-1,不限'==title && realValue!="10200000"){
                htmlTpl.push('<a href="javascript:void(0)" v="-1">不限</a>');
            }
        }else{
            if('-1,不限'==title && realValue!="10200000"){
                htmlTpl.push('<div class="area_box_tr"><a href="javascript:void(0)" v="-1">不限</a></div>');
            }

        }
        var bu=false;
        if('-1,不限'==title){
            bu=true;
        }
		var hasquxuxian=false;
        for(var city in pd){
			var citypds = pd[city];
            if("n"==city || "d" ==city){
                continue;
            }
			var readCity=city.substring(1,city.length);
			
            if(d || cityLevel==2 || cityLevel==3){
                htmlTpl.push('<a href="javascript:void(0)" v="' + readCity + '">' + citypds.n + '</a>');
            }else{
                htmlTpl.push('<div class="area_box_tr">');
                htmlTpl.push('<a class="' + (bu?'now2':'now') + '" href="javascript:void(0)" v="' + readCity + '">' + citypds.n+'</a>');
				/*if(bu){
					  tempHtml+='&nbsp;<a href="javascript:void(0)" v="'+readCity+'">不限</a>';
				}*/
                for(var citychild in citypds){
                    var name= citypds[citychild].n;
					var realcitychild=citychild.substring(1,citychild.length);
                    if(name){
                        htmlTpl.push('<a href="javascript:void(0)" v="'+realcitychild+'">'+name+'</a>');
                    }
                }
                htmlTpl.push('</div>');
				hasquxuxian=true;
            }
        }
        if(d){
            htmlTpl.push('</div>');
        }
        htmlTpl.push('</div>');
        mainId.html(htmlTpl.join(''));
		
		if(hasquxuxian){
			mainId.find(".area_box_tr:last").removeClass("area_box_tr").addClass("area_box_tr2");
		}
		//临时解决
		mainId.width(380);
		var filter='a:not(".now")';
		if(bu){
			filter='a';
		}
		mainId.find(filter).click(function(){
			var $this=$(this);
			var val=$this.attr('v');
			syscode.setCityText(id,val,title,hotcity);
			mainId.find('.select').removeClass("select");
			$this.addClass("select");
			mainId.hide();
			if(cityHandler){
				cityHandler.apply(null,[val]);
			}
			return false;
		});
        if ( $.fn.bgiframe )
            mainId.bgiframe();
        mainId.mousedown(function() {	
            mainId.data('hasfocus',true);
        }).mouseup(function() {
            mainId.data('hasfocus',false);
        }).click(function(){
			$("#"+id+"_hideShow").focus();
			return false;
		});		
    };
    syscode.provinceSelect = function(classStyle, id, name, cityid, realValue, defaultValue, title,label,handler,cityHandler,cityLevel) {
        this.createProvinceText(classStyle, id, name, cityid, realValue, defaultValue, title,label instanceof Array ? '' : label,handler,cityHandler,cityLevel,label instanceof Array ? label : []);
    };
    syscode.citySelect=function(classStyle, id, name, realValue, defaultValue, title,label,handler,cityLevel){
        this.cityText(classStyle, id, name, realValue, defaultValue,title,label,handler,cityLevel);
    };
	
	//判断是否是最底层值
	syscode.cityFloorValue=function(realValue){
		if(!realValue){
			return false;
		}
		//省级
		if("-1"==realValue||"10100000"==realValue||syscode.district[realValue]){
			return false;
		}
		var proValue=realValue;
        if(proValue>1){
            proValue=proValue.substring(0,5)+'000';
        }
		if(parseInt(proValue)>10200000){
			proValue="10200000";
		}
		var prefixproValue="c"+proValue;
		var prefixvalue="c"+realValue;
		var prefixWorkcitys = syscode.district[prefixproValue];
		var prefixvalueWorkcitys = prefixWorkcitys[prefixvalue];
		//市级
		if(prefixvalueWorkcitys){
			var hasThirdlevel=false;
			for(var p in prefixvalueWorkcitys){
                if("n"==p || "d" ==p){
                    continue;
                }
				if(hasThirdlevel){
					break;
				}
				hasThirdlevel=true;
			 }
			 if(!hasThirdlevel){
				return true;
			 }
		}
		//区级
		for(var p in prefixWorkcitys){
			if("n"==p || "d" ==p){continue;}
			for(var pd in prefixWorkcitys[p]){
				if("n"==pd || "d" ==pd){continue;}
				if(pd==prefixvalue){
					return true;
				}
			}
		}
		return false;
	};
	
    syscode.init=function(){
        for(var p in syscode.district){
			var districtp = syscode.district[p];
            for(var pd in districtp){
				var districtpd = districtp[pd];
                this.districtMap[pd] = districtpd.n;
                if("n"==pd){
                    continue;
                }
                for(var pdd in districtpd){
                    var name=districtpd[pdd].n;
                    if(name){
                        this.districtMap[pdd] = name;
                    }
                }
                this.districtMap[p] = districtp.n;
            }
        }
    };
    syscode.init();
	
	$(function(){
		$(document).bind("click",function(){
			$(".area_box").hide();
		});
	});
}());

(function($){

$.fn.bgiframe = ($.browser.msie && /msie 6\.0/i.test(navigator.userAgent) ? function(s) {
    s = $.extend({
        top     : 'auto', // auto == .currentStyle.borderTopWidth
        left    : 'auto', // auto == .currentStyle.borderLeftWidth
        width   : 'auto', // auto == offsetWidth
        height  : 'auto', // auto == offsetHeight
        opacity : true,
        src     : 'javascript:false;'
    }, s);
    var html = '<iframe class="bgiframe"frameborder="0"tabindex="-1"src="'+s.src+'"'+
                   'style="display:block;position:absolute;z-index:-1;'+
                       (s.opacity !== false?'filter:Alpha(Opacity=\'0\');':'')+
                       'top:'+(s.top=='auto'?'expression(((parseInt(this.parentNode.currentStyle.borderTopWidth)||0)*-1)+\'px\')':prop(s.top))+';'+
                       'left:'+(s.left=='auto'?'expression(((parseInt(this.parentNode.currentStyle.borderLeftWidth)||0)*-1)+\'px\')':prop(s.left))+';'+
                       'width:'+(s.width=='auto'?'expression(this.parentNode.offsetWidth+\'px\')':prop(s.width))+';'+
                       'height:'+(s.height=='auto'?'expression(this.parentNode.offsetHeight+\'px\')':prop(s.height))+';'+
                '"/>';
    return this.each(function() {
        if ( $(this).children('iframe.bgiframe').length === 0 )
            this.insertBefore( document.createElement(html), this.firstChild );
    });
} : function() { return this; });

// old alias
$.fn.bgIframe = $.fn.bgiframe;

function prop(n) {
    return n && n.constructor === Number ? n + 'px' : n;
}

})(jQuery);